module.exports = [{
    roleImg: "/images/role-gy.png",
    textImg: "/images/text-gy.png",
    type: "观音灵签",
    labelArr: [ {
        id: "第一签",
        lv: "上签",
        title: "钟离成道",
        content1: "开天辟地作良缘，吉日良时万物全;",
        content2: "若得此签非小可，人行忠正帝王宣。",
        detail1: "【卦意】此卦盘古初开天地之象，诸事皆吉也",
        detail2: "【解签】天地开创之时，凡事充满了新气象，正是良辰吉时，万事都已准备周全；能求得此签之人，非同小可，帝王曾亲宣无私公正之法，若能依理遵循，更行修身积善，相信好运更上层楼，持续久远不断。天开地辟。结良缘是天地开创之象。为大吉大利之象也。日吉时良。万事俱全顺遂之命。能蒙神指示为此签之人。非小可也。劝君必行中正帝王亦宣言曰。如能行之正直。积善。修身时。必能持之恒久。如宋太祖。赵匡胤之黄袍加身。急速非速言来时值观音降事报与君之者。",
        detail3: "【解释】此签有”谋事在人”之意。提醒当事人，未雨绸缪。会成功的人，除了本身的努力进取之外，对将来的一切，也早已预先考虑且准备周详。须知每个人的头上都有一片天，成败操之在己。平日稳扎稳打、厚实基础，更不间断地充实自我，为将来预作准备。凡事深谋远虑、从长计划，对于身边亲朋好友的建议，不妨虚心接受。等到时机成熟之时，亦是准备充足之时，自可从容不迫，满载而归。",
        detail4: "【典故】汉钟离，八仙之一。汉朝时，钟离原本为将军，因失机得不到朝廷器重，辞官而进入终南山隐居修道，后来得东华帝君传授仙法而成道，为八仙之首领。又传说，他原名钟离权，唐朝时代人，自称‘天下都散汉钟离权’。遇东华帝君后，又入崆峒三修炼，因而得道成仙，号称‘云房先生’。后皇帝诏封为太级左右宫真人。《八仙故事》"
    }, {
        id: "第二签",
        lv: "下签",
        title: "苏秦不第",
        content1: "鲸鱼未变守江河，不可升腾更望高;",
        content2: "异日峥嵘身变化，许君一跃跳龙门。",
        detail1: "【卦意】此卦鲸鱼未变之象，凡事忍耐待时也。",
        detail2: "【解签】就像鱼儿尚未成熟，还不到可以离水飞升的程度;此时忍耐守静则吉，等到时机来临之日，蜕变之时，必可大展身手，一跃过龙门。) 得忍且忍，得耐且耐，身不用忙，功名自在。此签鲸鱼未变之象，凡事进退待时。 鲸鱼未化守江湖。姜太公之受难时也。为大鲸未变之象。凡事进退待时。不可轻举妄动。动则凶。静则吉。君尔也。得忍且忍。得耐且耐身不而忙。功名自在者。来日峥嵘蜕身时。一跃可过禹门者。 ",
        detail3: "【解释】此签有”守时待势”之意。意味当事人，随遇而安。人的一生高低起伏，难免有不顺遂的时候，若不如意的情况接踵而来，更易叫人灰心丧志。须知事在人为，切勿被一时的失意所打垮。此时烦躁冒失有害无益，切忌沉不住气、冲动妄为。凡事保持心平气和，忍一时风平浪静。纵使遭人讥嘲误解，只要知所当为，又何须耿耿于怀。不要放弃任何希望，凡事乐观，相信自己并坚持到底，必有苦尽甘来、如愿以偿之日。",
        detail4: "【典故】 苏秦是春秋战国撕东周洛阳人，合纵论的代表人物。幼时跟随鬼谷子学习游说术，学成之后，便到各国去游说，谋个高官厚禄，可惜毫无成就，依然贫困落拓，后发愤读研姜太公兵法，再出来游说各国联合对抗强大的秦国。‘不第’就是古时考试不及格，不被录取。《金印记》传奇"
    }, {
        id: "第三签",
        lv: "下签",
        title: "董永遇仙",
        content1: "临风冒雨去还乡，正是其身似燕儿;",
        content2: "衔得坭来欲作垒，到头垒坏复须坭。",
        detail1: "【卦意】此卦燕子衔坭之象，凡事劳心费力也。",
        detail2: "【解签】顶着风冒着雨来来回回，就像燕子般辛勤奔波不歇;忙碌费力含来的小泥团，好不容易堆砌成土块，有个样子了，哪里知道最后却又崩坏，土块再度变回泥团。)千般用计，晨昏不停，谁知此事，到底无成。此签燕子衔泥之象，凡事空心劳力。冲风冒雨去还归。役役劳心似燕儿。君尔之运逢燕子衔泥筑巢之象耶。空心徒劳。无益者。为先难后甘之运。唯应小心。本签之总结也。千方百计。晨昏碌碌不停。谁知此事到底无以可成者。修之。悟之。",
        detail3: "【解释】此签有”束手无策”之意。奉劝当事人，勿举棋不定。有些人个性刚直、做事一板一眼，临事却不知变通，往往因而错失良机。须知凡事各有利弊，有舍才有得。事有轻重缓急，与其一昧墨守成规，不如跳脱思维、因地制宜，视情况环境调整自己的原则与做事方法。或集思广益、共同研拟商议，找出解决之道。切忌犹豫不决又固执己见，流于空想而怯做，终将空心劳力，徒然庸人自扰罢了。",
        detail4: "【典故】神话故事。传说汉朝时董永因无钱葬父，卖身为奴，替人做长工。他的孝心感动了天上的仙女，私自下凡来和他结为夫妻，白天劳作，夜间织布，使他得以还债赎身，恢复自由，一年后，仙女辞别回天。《织锦记》《天仙配》故事"
    }, {
        id: "第四签",
        lv: "上签",
        title: "玉莲会十朋",
        content1: "千年古镜复重圆，女再求夫男再婚;",
        content2: "自此门庭重改换，更添福禄在儿孙。",
        detail1: "【卦意】此卦古镜重圆之象，凡事劳心有贵也。",
        detail2: "【解签】花破镜如何能够重圆，男女各有欲追求的姻缘；此后将有一番新气象，惟再积德修善，功德更添福禄，并有助后代儿孙安康。五五念五，骑龙跨虎，事虽劳心，于中有补。此签破镜重圆之象，凡事成就则吉。菱花镜破镜重圆。为破镜重圆之象。凡事成就吉者也。不是上上者。为中中之签。是先凶后吉之签。交易持公平。求财亦在秋冬转旺。如逢如此之中中运也。可积极为善。积德。当有转吉之机。",
        detail3: "【解释】此签有”历久弥坚”之意。意味当事人，不改初衷。须知”人生以服务为目的”，无论各行各业，应秉持着服务人群的精神、坚守做事原则，不存一己之私。切忌被外在的因素影响而轻易弃守原本的理念。凡事一片赤诚、以利他为先，即使人事环境不断地交替更迭，也不会因外在的因素而有所动摇。纵使偶有闲言闲语，但自问无愧于心，面对蜚短流长，又何妨一笑置之。流言不攻自破，真理不辩自明。只要抱守初衷，坚持信念，自可处之泰然、乐在其中。",
        detail4: "【典故】宋朝王十朋少时家贫，好学不倦，和钱玉莲订婚以荆钗为记。结婚后，十朋上京赴考，夫妻暂时离别，奸人孙汝权迫玉莲相嫁，玉莲不从，投河自杀，被救。同时十朋中了状元，也不肯取丞相的女儿为妻，因此被皇帝贬职，后来玉莲经过了许多波折，终于和十朋相会，夫妻重复团圆。《荆钗记》传奇故事"
    }, {
        id: "第五签",
        lv: "中签",
        title: "刘晨遇仙",
        content1: "一锥凿地要求泉，努力求之得最难;",
        content2: "无意偶然遇知己，相逢携手上青天。",
        detail1: "【卦意】此卦锥地求泉之象，凡事先难后易也。",
        detail2: "【解签】想要靠一支锄头挖得泉水，必定要十分努力才有可能得到;积极努力奋斗，在无意间遇到了伙伴知己，互相帮助合作，必定可以成功，携手共创前程。望中心事，今可方求，百事营谋，立地堪求。此签堀土求泉之象，凡事劳心成就。一锄掘地妥求泉水。此象则表征君之运途。是凡事谋略之后。劳心方有成就者也。努力向前必有化凶为吉之时。自励奋斗。偶然遇知己。彼时即是君尔。得贵人之刻。在伊人扶持下。必能上青天矣。",
        detail3: "【解释】此签有”休戚相关”之意。意味当事人，推诚相与。有些人为了打响自己的招牌，不惜砸下重金投资，或认为”外来的和尚会念经”，宁可大量对外延揽人才。却不知许多人才或资源也许近在眼前，却被忽视而浑然不觉。须知要巩固长久的名声不坠，还是必须一步一脚印、从自身做起。无论士农工商，如能以身作则、不耻下问，对自己身边的人谦恭有礼、善待有佳，给予优渥良好的福利，让其无后顾之忧，自然会吸引更优秀更杰出的人才慕名而来。凡事只要稳扎稳打、用心经营，相信无须劳心费力，自然有口皆碑，声名远播。",
        detail4: "【典故】东汉朝时代人。永平年间，刘晨和阮肇国二人进入天台山采药，遇二仙女，颜色绝丽，邀请刘晨和阮肇国至女家，食以胡麻饭，同结为夫妻。住了约半年，二人要求回家，到家后才知道子孙已过了七世了（约百多年时间）。二人再回去找仙女，终找不到原路。刘羲庆：幽明录《长生乐》传奇。"
    }, {
        id: "第六签",
        lv: "中签",
        title: " 仁贵遇主",
        content1: "投身岩下铜鸟居，须是还他大丈夫;",
        content2: "拾得营谋谁可得，通行天地此人无。",
        detail1: "【卦意】此卦投岩铜(雕)鸟之象，凡事宜顺吉之兆。",
        detail2: "【解签】将自己丢在险峻的山崖下喂饲于老虎，仍然不会改变他大丈夫的情操;愿意这样舍身的人恐怕再也难以遇到，走遍天下也找不到第二个相同的人了吧。为使十分，身清岂贫，待他时至，详与君知。此签岩下饲菟之象，凡事宜顺则吉。于岩下饲于菟者。是凡事宜顺则吉之表征也。得本签之君。应知。为人宜守旧。不可轻举妄动者也。不可贪求非份之外之财。或舍近图远者。皆避免之。予以君知者。使十分清身。岂贫待他时至祥。",
        detail3: "【解释】此签有”见机行事”之意。意味当事人，智勇兼备。人有时会碰到他人故意刁难，甚至以强欺弱、仗势欺人，让事情更加棘手。在此情境之下，常因忍不下一口气，愤而误事。须知有勇无谋于事无补，与其冲动气愤、闹得两败俱伤，还不如保持冷静，用智慧与理智思考应对之道。故事中蔺相如之所以能完璧归赵，即是因为拥有当机立断的机智，与直言不讳的勇气。凡事除了深思熟虑，也应兼具勇敢果断的胆识，适时言所当言、据理力争，无须畏惧强权，以免错失良机。",
        detail4: "【典故】唐朝李世民皇帝时的征东大将薛仁贵，神武英勇。初年不得志，三次投军不被重用，只任火头军（厨师），打仗有功劳也是由张土贵女婿何忠宪冒领。后李世民在梦中得见薛仁贵，及至世民被盖苏文追杀，仁贵及时出现救了世民（唐太宗）。后几经挫折，仁贵才见到太宗皇帝。《薛仁贵东征》故事"
    }, {
        id: "第七签",
        lv: "下签",
        title: "苏娘走难",
        content1: "奔波阻隔重重险，带水拖坭去度山;",
        content2: "更望他乡求用事，千乡万里未回还。",
        detail1: "【卦意】此卦拖坭带水之象，凡事守旧则吉也。",
        detail2: "【解签】奔波役役重重险。带水拖泥又渡山之运途也。凡事必须谨慎。准备酌理。探取根源。明其是非者。审一己之进退。方向者。心存恶者得祸。存直者即可为获福矣。祸福者皆由人作之。退身可得进步难为。只宜守田切莫高扳。奔波役役重重险。带水拖泥又渡山之运途也。凡事必须谨慎。准备酌理。探取根源。明其是非者。审一己之进退。方向者。心存恶者得祸。存直者即可为获福矣。祸福者皆由人作之。退身可得进步难为。只宜守田切莫高扳。",
        detail3: "【解释】此签有”一念之差”之意。奉劝当事人，三思而行。一般人常对现状有所不满，或羡慕别人的际遇或地位环境，认为样样都比自己好，因此汲汲向外寻求，期望藉此获得另一片发展。人应珍惜现有的环境与资源，知福、惜福。谨记在做任何决定之前，务必慎重思量、仔细评估本身与环境的优弱势，找出最适合自己的定位与方向。切忌一时冲动负气出走，结果恐不如预期，既无法适应发挥所长，又藕断丝连、怀念原先熟悉的事物，将陷入进退两难、后悔莫及之境。",
        detail4: "【典故】苏娘是指苏英娘娘。周朝景王（公元前544——520）时，西番国王进贡了三件宝物：温凉盏、醒酒毡、能言鸟（会说话的鹦鹉），皇帝十分高兴，问谁人能逗鸟说话，结果没有人能够，只有东宫皇后苏英娘娘能逗鹦鹉说话，即刻获得皇帝赞赏，西宫皇后梅玉春十分嫉妒，怀恨在心，诬陷苏英入死罪，兴得忠臣潘葛以自己的妻子代替苏英死刑，苏英漏夜出走，逃亡中到了白马寺，生下了太子。弹词宝卷书曰：《苏英皇后鹦鹉记》"
    }, {
        id: "第八签",
        lv: "上签",
        title: " 斐度还带",
        content1: "茂林松柏正兴旺，雨雪风霜总莫为;",
        content2: "异日忽然成大用，功名成就栋梁材。",
        detail1: "【卦意】此卦此卦松柏茂林之象，凡事有贵气也。",
        detail2: "【解签】犹如岁寒中的松柏，根深稳固，纵使天候恶劣、饱受风霜雨淋，也不会因此而被摧折;相信将来有一天一定可以有很大的用途，成为功成名就的栋梁之材。平地风光，夙缘有定，丰熟田稻，家获余庆。此签松柏茂叶之象，凡事正直则吉。本签为松柏之岁寒者。任何之树木枯之后。仍挺具秀者。各面均呈祥。当异日成大材老焉。是大器晚成型。惟不可因此满足。必须因此更加培植。事事积德。方可有更好之明日。要之。象征平地风光夙缘有定。丰熟田稻家获余庆。",
        detail3: "【解释】此签有”事在人为”之意。鼓励当事人，自强不息。有些人常常虎头蛇尾，短时间的努力不见成效，就打算放弃。然而会成功的人，背后的打拚必定多于常人，辛苦也不足为外人道。范仲淹画粥的故事，最令人感佩的即是他过人的耐力、专注的自制力以及经年累月，从不间断刻苦读书的精神。就如岁寒松柏，在历经雨雪风霜的侵袭后，仍然挺立不摇，坚强地存活下来。因此凡事若定下目标，就应全力以赴。切勿轻言放弃导致功败垂成。只要继续努力、持之以恒，必能先苦后甘，得到丰硕完美的成果。",
        detail4: "【典故】斐度还带。斐度是唐朝宪宗皇帝的宰相,在年轻时,斐度家境贫困。一日到香山寺拜佛,在地上拾到价值连城的玉带数条,寻访物主,终得归还。以此积德,反得高官厚禄,富贵荣华。后考中进士,任宰相,督师破蔡州,平潍西。晚年辞官居洛阳。"
    }, {
        id: "第九签",
        lv: "中签",
        title: " 孔明点将",
        content1: "烦君勿作私心事，此意偏宜说问公;",
        content2: "一片明心光皎洁，宛如皎月正天心。",
        detail1: "【卦意】此卦皎月当空之象，凡事光明通达也。",
        detail2: "【解签】辛苦你来问我心中疑虑的事，若能执中无私往这个道理最好;倘若心里清澄如镜就能透澈事理，就好似天上皎洁的月亮照耀了整个夜空。心中正直，理顺法宽，天无私意，莫空虚看。此签皎月当空之象，凡事正直则吉。本签者皎月当空之象也。凡事正直则吉之签。虽是前运不佳。前事去之后。渐见顺利者。君尔幸获此签之示者。平素之存心种德之所由成。后得如此之佳境。亦即是心中正直。理顺法宽天无私意莫空虚看。",
        detail3: "【解释】此签有”杂不如精”之意。提醒当事人，凡事融会贯通。大部分的人都觉得，能够学到的东西越多越好。因此寻求多才多艺，但对单一的技能却尚未领悟其精髓。所谓”术业有专攻”，与其学得杂，不如学得精;一门功夫要练到炉火纯青，绝非短期内可促成。故事中赵韩王之所以能用半部论语定天下，即是因将所学施展到极致之故。因此不论做什么事、求什么学问，务必先扎稳根基、穷究其理;掌握诀窍之后，再经由不断地揣摩与练习，才能将所学发挥到淋漓尽致，并能举一反三，转变为本身特有且难以撼动的绝技。",
        detail4: "【典故】诸葛亮（孔明）被刘备请下山，被礼为军师。时夏侯享引兵攻打刘备，孔明随即调兵点将，准备迎战，但关公张飞都不服气。双方军队会战于博望坡，结果刘备军队大获全胜，证明了诸葛亮军事的高明策略，关张二人从此信服。"
    }, {
        id: "第十签",
        lv: "中签",
        title: "庞涓观阵",
        content1: "石藏无价玉和珍，只管他乡外客寻;",
        content2: "宛如持灯更觅火，不如收拾枉劳心。",
        detail1: "【卦意】此卦持灯觅火之象，凡事待时成就也。",
        detail2: "【解签】木盒里就暗藏难以计价珍奇的宝物，却只会想着往外乡异地去寻找;就好似已把了盏灯却还到处找火，还不如先冷静下来别再劳心。机缘若遇，何事不成，春无限前似真。此签将灯觅火之象，凡事自就。将灯不见火之象，凡事自就之表征者，逢此下下之时，宜顶天拜地，始可得无灾，是谋望之不成，修吾身后，积德，布施，后必有回天之机，亦即是机缘若遇何事不成春无限意眼前似真此者也。",
        detail3: "【解释】此签有”枉费心机”之意。奉劝当事人，凡事不要强求。人很难感到知足，总是想要更多、想追求的更好，于是千般用计、终日汲汲追求，只为了据为己有，好满足自身的欲望。须知”欲望”乃是无穷止尽的深渊，让人深陷其中而浑然不觉。谨记”知足常乐”，应珍惜现在身边所拥有的事物，淡泊物质名利的渴求。在做任何事之前，先审慎评量自己是否需要。须知”命里有时终须有”，不属于自己的一切，就算强求也是枉然，只是白费心机而已。",
        detail4: "【典故】庞涓和孙膑同是春秋战国时代人，二人一起向鬼谷子学习兵法。庞涓先下山到魏国做事，掌管兵权；孙膑不久也下山会见庞涓，共为魏国服务。后来庞涓削了孙膑的双脚，使他残废。孙膑逃到齐国，被任军师，田忌任大将。孙膑令田忌带兵攻打庞涓，并排成阵势挑战，庞涓乘车观看，认得是孙膑的颠倒八门阵。结果庞涓破不了此阵，大败逃回魏国。"
    }, {
        id: "第十一签",
        lv: "上签",
        title: "书荐姜维",
        content1: "欲求胜事可非常，争奈亲姻日暂忙;",
        content2: "到头竟必成鹿箭，贵人指引贵人乡。",
        detail1: "【卦意】此卦因祸得福之象，凡事营谋吉利也。",
        detail2: "【解签】盼望求得佳事因而欣喜异常，奈何忙碌一时成为亲属的愿望还是暂无消息;须知到最后毕竟好事成双，自有贵人接引前往贵人乡。有事盼望，到底如斯，若问此事，贵人提携。此签因祸致福之象。凡事则吉。因祸致福之签。凡事则吉者也。曰欲求好事喜十分。暂时安当守份之时。虽是不合之时。亦可有成之时。贵人自有贵人引导之者。因此。君尔之前途是极光明者。有事盼望到底如斯若问此事贵人提携耶。",
        detail3: "【解释】此签有”见机行事”之意。提醒当事人，凡事处之泰然。人有时会碰到”不得不”的情况，或许是不可抗拒的、或许是强加于己的，却也只能硬着头皮去做，但心中却惴惴不安。所谓”既来之，则安之”。在事情未成定论之时，无须预设太多立场、杞人忧天。持稳身心、处之泰然，把面临的状况当成一种磨练、一种经验，从这个经验中所得到的，不管是有形或无形的收获，绝对是正面的、出乎意料的。另外在抉择不定时，不妨听取身边亲朋好友的意见，有助事情迎刃而解。",
        detail4: "【典故】姜维是三国时人，原本为魏国战将，被诸葛亮收服，改投刘备。姜维智勇双全，最得诸葛亮（孔明）器重，孔明六出祈山，不久病于五丈原，自知命在旦夕。一日姜维入帐，孔明就将他生平所学的知识，已经著书二十四篇，计十万四千一百一十二字，内有八务、七戒、六恐、五惧之法，全部传授给姜维，希望姜维能继他之志，竭忠辅主，为国家出力。不久后，孔明去世。书荐姜维，就是《书献姜维》，《三国演义》故事"
    }, {
        id: "第十二签",
        lv: "上签",
        title: "武吉遇师",
        content1: "否去泰来咫尺间，暂交君子出于山;",
        content2: "若逢虎兔佳音信，立志忙中事即闲。",
        detail1: "【卦意】此卦祸中有福之象，凡事先凶后吉也。",
        detail2: "【解签】坏运已经走到了尽头，好运就要来临，请振作精神走出灰暗的阴霾;遇卯寅时自有好消息到来，坚定信念定可顺心和谐。麻换得丝，是笑虽哭，要见分明，是见为福。此签祸去福来之象，凡事先凶后吉。时临否极泰当来。多年来之恶运。霉运已去。吉星高照之时。事事顺利。一路顺风。毫无阻碍者。将身上抖之擞之。身上之暗埃尽去。尤在卯寅佳信至时。要之。麻换得丝是笑虽哭。要见分明是见为福。",
        detail3: "【解释】此签有”勇往直前”之意。鼓励当事人，百折不挠。有时人在遇到阻碍刁难或被拒绝等不如意的情况发生时，便会心生退惧之意，甚至就此放弃。须知成功并非遥不可及，在努力的过程中，必然会面临各式各样的挑战，考验当事者的决心。故事中申包胥为了求得秦国的援兵，连续七昼夜不眠不休，诚意终于感动秦主愿意出兵增援，让楚国不致灭亡。由此可知，凡事除了必须下定决心之外，还要有坚强的意志力与不屈不挠的毅力。不论过程有多艰难困苦，绝勿轻言放弃，朝着目标持续努力，相信成功之日，已经近在眼前了。",
        detail4: "【典故】武吉本来是砍柴的樵夫，认识了在胃水旁钓鱼的姜太公（子牙）。后来进城时误杀了人，被捉判死刑，武吉求救于姜太公，太公收他为徒弟并施法解救他。后来武吉被拜为大将，讨伐纣王。《封神榜》故事"
    }, {
        id: "第十三签",
        lv: " 中签",
        title: "罗通拜帅",
        content1: "自小生在富贵家，眼前万物总奢华;",
        content2: "蒙君赐紫金玉带，四海声名定可夸。",
        detail1: "【卦意】此卦龙门得遇之象，凡事有变大吉也。",
        detail2: "【解签】从小生长在富有的家庭，身边的一切所见必然极尽奢华;受邀接受国家的封赐也不居功，这样的谦让真足以名扬四海众人皆夸。囚徒得赦，病遇良医，龙门得过，名显皇都之象。凡事变化则吉。君尔也。自小生身富贵之家。于是君汝之生活也。总是奢华之世界者。谋望皆成。惟有贵人之扶持者。必能称意。且不劳而成者。易言之。囚徙得赦。病遇良医。龙门得过。名显皇都之象。凡事变化则吉也。",
        detail3: "【解释】此签有”谦让未遑”之意。提醒当事人，施恩不求报。当有人向我们求助时，凡所当为，义不容辞。倘若抱着希望对方回报的预期心理，就失去了原本为善的美意。须知”有心的功德不是真功德”。助人的根本意义，在于无心且单纯地去做，解决了问题之后，心里的快乐，绝非外在的有形物质可比拟。切勿期待对方有所代表、或因此窃喜念念不忘。相反地，倘若自己受到帮助，即使是小小的恩惠，也要谨记在心、不可或忘，有机会立即加以报答。谨记施比受更有福，为善不足挂齿。",
        detail4: "【典故】罗通是唐初时英雄好汉，父亲叫罗成，英勇善战，十七岁时，在演武场上比武夺得帅印，领兵征伐北方的敌人，立下汗马功劳。后因迫死屠炉公主而触怒唐太宗皇帝，被削除官职，不能娶妻。后程咬金求情，得皇帝宽赦。《罗通北扫》故事"
    }, {
        id: "第十四签",
        lv: "中签",
        title: "子牙弃官",
        content1: "宛如仙鹤出樊笼，脱得樊笼路路通",
        content2: "南北东西无阻隔，任君直上九霄宫。",
        detail1: "【卦意】此卦仙鹤离笼之象，凡事先凶后吉也。",
        detail2: "【解签】好似仙鹤飞出了牢笼，终于挣脱长久羁绊痛苦的束缚;无论东西南北都将畅行无阻，任你展翅翱游直上九霄云外去。从心无虑，远达亨衢，道心自在，任意所如。此签白鹤冲霄之象，凡事先忧后吉。为白鹤冲霄之象也。凡事先忧后吉之大吉签。功名成就。生意鼎盛。婚姻完满。财路亨通之时。宜再多阅圣贤书。修吾身。积吾德。必有喜讯连连之日来也。要之。从心无虑远达亨衢道心自在任意所如者耶。",
        detail3: "【解释】此签有”公私分明”之意。提醒当事人，豁达大度。有时我们会面临到必须和某人相处共事，偏偏此人曾与你结怨、旧恨未消。在此情境之下，如何化解心中的不快与尴尬，才是最难解的课题，考验当事者的智慧。换个角度思考：很多争执误会都是在不得已或无心的情况下发生。所谓”退一步海阔天空”，应该先抛开心中旧有的成见，同时勿预设太多立场，尽释前嫌。凡事以大局为重、就事论事，不计较个人恩怨。放宽心胸、放大格局，只要心中坦然，必可无所覊绊、从心无虑。",
        detail4: "【典故】 姜子牙（姜太公）离开昆仑山后，住在宋异人家，一无所成，样样失败，时已七十二岁了，火烧琵琶精后，被推荐在纣王宫廷谋一小官做。一天纣王要兴建鹿台以宣yin行乐，请子牙设计建造。子牙反对，同时向纣王谏了一番，因畏罪遁水而逃。弃官回到宋异人家。后来子牙到胃水钓鱼过日子，等待时机。"
    }, {
        id: "第十五签",
        lv: "中签",
        title: "苏秦得志",
        content1: "行人怨日气难吞，忽有灾事勿近前;",
        content2: "鸟破林巢无所宿，可寻深处稳安身。",
        detail1: "【卦意】此卦鸟鹊离林之象，凡事到底应心也。",
        detail2: "【解签】 与人口角的怒怨之气最难以吞咽，却不知祸从口出;细想卵破巢空之后哪里还有栖歇之地，自保之道只在于修身养性罢了。若得人怨，何事可伸，如言不信，到底劳心。此签卵破巢空之象，凡事守旧则吉。",
        detail3: "【解释】本签示之于弟子曰。触人口气最难吞。如交友中盛气凌人者。令人难以容忍者。亦即是灾厄临时之兆。不可不知也。得罪于人者。如覆巢之祸。爰之。劝君稳便一语存于心。方能有吉。易言之。若得人怨何事可伸。如言不信到底为劳心。巢空之象。因此。凡事守旧则吉者也。此签有”自食恶果”之意。奉劝当事人，勿一意孤行。有些人的个性直接、作风霸气，做事或说话不留情面，常让人因此尴尬愤怒、下不了台。明知有人不满，也毫不在乎。须知举止过于强悍不留余地最易与人结怨，让人怀恨在心。日积月累，得罪的人越多，对自己越是不利。凡事都应谨言慎行、保持柔软低调的身段、兼顾法理情。对于身边亲朋好友的劝谏，务必虚心接受、认真思考不是处并加以改进。切忌当成耳边风我行我素，免得届时陷入无人愿意出手相助、有理说不清之境，后悔也为时已晚",
        detail4: "【典故】苏秦不得志后，发奋图强，痛下决心研读太公兵法，再出来谋事。他到了燕国，见了燕文侯，说服了他联合赵国对抗强秦。文侯给了他车马和金帛，后又说服了赵王，得到黄金千两和其他礼物。赵王请他去游说各国诸侯，联合对抗强大的秦国。苏秦因此被六国重用，封他相印，并配以宝剑。《金印记》传奇故事"
    }, {
        id: "第十六签",
        lv: "中签",
        title: "叶梦熊朝帝",
        content1: "愁眉思虑暂时开，启出云霄喜自来;",
        content2: "宛如粪土中藏玉，良工荐举出尘埃。",
        detail1: "【卦意】此卦阴阳和合之象，凡所谋皆吉也。",
        detail2: "【解签】 抛去心中的哀愁不再愁眉不展，从此运程向吉拨云见日;就好像那原本埋没在污泥中的清玉，待得良匠视出掘起便远离了尘垢。得处无伪，损中有益，顺逆吉凶，君子得吉。此签如玉在泥之象，凡事遇贵则吉。如玉在污泥中之象。如获良工贵人一举。牵成时。出污泥则。可获吉也。亦即是表明君之今也。咫尺眼前之云拨开即得见日者。时运将到者。曰：得处无伪损中有益顺逆吉凶君子得吉之签。",
        detail3: "【解释】此签有”忠言逆耳”之意。意味当事人，饮水思源。从小到大，我们身边多少会有关心自己的人。诸如父母、师长、朋友...等，或许心直口快直言不讳，但应知忠言逆耳，其用意无非是希望我们行得正、坐得稳，不致产生偏差的行为。应时刻抱持感恩的心，珍惜图报、用心体会。切勿轻视忽略，或视为理所当然、不放在心上。免得忽然有一天，关心的人不见了，离开了，才猛然领悟对方的语重心长而愧叹思念，到时岂不徒然，空留遗憾。",
        detail4: "【典故】叶梦熊是明朝嘉庆年进士，为人有胆识，忠贞爱国，万历年间，承恩在边疆地带滋扰，造成社会不安宁，可是却没有人敢前往平乱。梦熊极为愤慨，亲自上朝晋见神宗皇帝，要求领兵前往讨伐，为国效劳。《龙剑记》传奇（曲海总目提要）"
    }, {
        id: "第十七签",
        lv: "中签",
        title: "话梅止渴",
        content1: "莫听闲言说是非，晨昏只好念弥陀;",
        content2: "若将狂话为真实，画饼如何止得饥。",
        detail1: "【卦意】此卦画饼充饥之象，诸事多虚少实也。",
        detail2: "【解签】别听那些流言蜚语是是非非，日夜勤行专念佛号安定自己的身心;倘若把一切的虚妄执着假象都信以为真，就好像在纸上画的大饼要如何能够止住饥饿。心中不定，枉费看经，只是画饼充饥之象。凡事虚少实。如心中不定则看经也枉费心神是已。何以为之。又如人之妄语信之为真。岂非如画饼之充饥。焉得饱食。因时运之未到。时有吉。时有凶。劝尔宜晨昏多念阿弥陀佛。莫听闲言及是非。方可安行。凡事虚少实也。",
        detail3: "【解释】此签有”居心叵测”之意。奉劝当事人，勿心存歹念。有些人会因为别人的才华或才能高过自己而眼红猜忌、又害怕就此被取代，因此处心积虑，或百般阻挠、或肆放谣言。须知人与人相处，最可贵之处在于互信互助、共同扶持，最忌暗箭伤人、尔虞我诈。凡事应持心正直，起心动念皆向善。从自身做起，不道人长短、不搬弄是非。与人合作共事方面，保持和谐良性切磋，见贤思齐、截长补短。多替他人着想，勿存一己之私。",
        detail4: "【典故】曹操带着军队去打仗，正值天气炎热的时节，士兵们汗流浃背，口干舌燥，但却找不到一滴水喝。士兵们个个筋疲力尽，几乎连路的力气也没有了。这时，曹操想出一个主意，下令说：前面就是一大片梅树林，到了那里就可以吃梅解渴了。士兵们听到吃梅子，口水直流。便不觉得口渴了。《三国演义》故事"
    }, {
        id: "第十八签",
        lv: "上签",
        title: " 曹国舅为仙",
        content1: "金乌西坠兔东升，日夜循环至古今;",
        content2: "僧道得知无不利，士农工商各从心。",
        detail1: "【卦意】此卦阴阳消长之象，凡事遂意之兆也。(金乌指太阳,玉兔指月亮)",
        detail2: "【解签】太阳西沉月亮就初升，从古至今日夜交替循环不歇；僧道之士体悟了这种自然运行的法则因而无所罣碍，即便是士农工商三百六十行又有什么分别呢？心中无事，所作有功，如弓上箭，一发当中。此签皎月东升之象，凡事亨泰如意。皎月当夜空，繇东方上升之象。爰之事事亨泰如意者。心中无事。所作皆奏功。又如上弓之一箭。发之即中也。君之今堪称如日月日夜循环亘古今。僧道得之无不利。因此。工商农士无不一一笑逐颜开者。",
        detail3: "【解释】此签有”言之成理”之意。提醒当事人，勿过于主观。有些人本身通晓事理，加上对人事物观察入微，因此能够掌握先机，猜测事情的发展也往往不出所料。须知本身有一定的自信是必要且可喜的条件，但却不能太过或绝对地主观。过于主观在无形中会渐渐导致个人的自满自傲且无法接受其它不同的意见或批评。当知事情没有绝对，每个人的想法也随时都会改变。因此切忌光凭个人的角度来果断做决定或判断喜恶。仍应保持谦恭谨慎的态度，凡事客观、包容。",
        detail4: "【典故】 曹国舅是八仙之一，宋朝人，曹太后的弟弟。其弟不守王法，常杀死人。国舅深感耻辱，于是散尽家财，周济穷人，自己进入山林修道。后来遇汉钟离个吕洞宾，得到指点而成仙。《八仙》故事"
    }, {
        id: "第十九签",
        lv: "中签",
        title: "子仪封王",
        content1: "急水滩头放船归，风波作浪欲何为;",
        content2: "若要安然求稳静，等待浪静道此危。",
        detail1: "【卦意】此卦船行急滩之象，凡事守旧待时也。",
        detail2: "【解签】在天候恶劣之时欲驾小船，然而此刻狂风大浪，能有什么作为呢?等待风止浪歇之后，相信才可以平安地满载而归。急水放船，险行待时，若问营谋，时至可为。此签行舟浪淘之象，凡事守旧则吉。行舟浪淘之象。亦即是险境者。要之。君尔应知目下宜守旧。愿遵守静则吉。妄为则凶也。杨雄之仕王莽之朝为大夫。何以能胜大任。如在急水滩头放水之险行。待时若问营谋。时至方可为。千万叵轻举妄动。",
        detail3: "【解释】此签有”自甘堕落”之意。意味当事人，勿随波逐流。有些人为了取悦或取信对方，不惜昧着良心，一味巴结。这种矫饰的作为，容易引起他人的反感与不齿，纵使爬上高处，地位也难以稳固。凡事应坚守道德、无愧于心，靠自己努力打拚。虽然无法一步登天，但辛苦耕耘定有所成，且凭自己的实力所表现的成果，必可获得众人的肯定支持，声望不坠且难以撼动。另外，慎选合作对象也很重要。因此不论对方的人品、自我情绪管理、或待人接物方面，都是必须考虑在内的因素。",
        detail4: "【典故】郭子仪是唐朝大将军，也是历史上著名的大将。安禄山和史思明叛乱，郭子仪率军讨伐，常把敌人打得落花流水。六十余年征战，经过七个皇帝，战绩累累，功劳显赫，后唐肃宗重用郭子仪，拜为副元帅；并晋封汾阳郡王，再领大军出征平乱。建中二年（公元七八一年）郭子仪病重逝世，郭寿八十五岁。"
    }, {
        id: "第二十签",
        lv: "中签",
        title: "姜太公遇文王",
        content1: "当春久雨喜开晴，玉兔金乌渐渐明;",
        content2: "旧事消散新事遂，看看一跳过龙门。",
        detail1: "【卦意】此卦久雨初明之象，凡事遂意也。",
        detail2: "【解签】春天下了好久的雨终于止歇，月亮与太阳也因云雾散去而渐渐恢复了光明;想做的事情慢慢也会达到目的，很快地便可以跳入新的格局境界了。佛神护佑，百事无虚，想平生事，到底胜初。此签久雨初晴之象，凡事亨通。本签者也。久雨初晴之象。为万事可成之兆。惟得此吉签。必须早植因缘。之后当有莫大利益。君尔在交友之中。宜留意者。必须选中之一为贵人。彼将成王公封爵之贵。将有大成之日。汝必能攀附上。易言之。佛神护佑百事无忧想平生事到底胜初者。",
        detail3: "【解释】此签有”苦尽甘来”之意。鼓励当事人，坚持到底。一般人对不熟悉的事物，总是会感到陌生而惧怕。须知会成功的人，本身一定有过人的毅力，与百折不挠的精神。当我们在羡慕别人有一番成就的时候，千万也别忘了其背后所付出的心血与努力。俗云：”一回生，二回熟”。凡事只要下定决心，就应坚持到底，藉由不断的摸索与尝试，从错误与失败中汲取教训、累积经验，日久必能得心应手、游刃有余。因此勿畏难怕苦，须知现在所做的一切，都有可能关系到将来。",
        detail4: "【典故】封神榜故事。姜太公（子牙）已年近八十岁，这时，他在胃水旁垂钓，等待时机，周文王夜梦飞熊，在有贤人出现，于是亲身到胃水来访姜太公，并礼聘他辅佐治理国家，封他为‘丞相’之职。后周文王得天下八百余年，是为《周朝》。"
    }, {
        id: "第二十一签",
        lv: "上签",
        title: " 李旦龙凤配合",
        content1: "阴阳道合总由天，女嫁男婚喜偎然;",
        content2: "但见龙蛇相会合，熏熏入梦喜团圆。",
        detail1: "【卦意】此卦阴阳道合之象，凡事和合大吉也。",
        detail2: "【解签】阴阳和合因果交替循环，这是自然不变的道理，男女之间的姻缘婚配难道只是巧合?且看龙腾蛇行交会之时，吉梦维何?维熊维罴，这是很好的吉兆啊。营谋皆遂，婚姻孕男，资财积聚，更吉田蚕。此签阴阳道合之象，凡事和合大吉。阴阳道合之签也。凡事和合而大吉者。君逢此为上吉之运。凡事渐获进步。惟不可欲速成。更不得存有欺人之心。今之形成者。获来不易。佳境之时。宜更修之。省之。积吾善可也。易言之。君之今。营谋皆逐。婚姻孕男。资财积聚更吉田亩之收。",
        detail3: "【解释】此签有”一探究竟”之意。鼓励当事人，保持旺盛的好奇心。须知很多事情虽然看似错综复杂，但详加深入了解之后，便会发现其实并没有想象中那么困难。凡事穷究源头，用心体会、细心观察、深入探讨研究，必能看出其中的奥妙，进而消化吸收之后，转为自己的一套做人处世之道，再推己及人。唯有自己亲身去尝试、体悟出来的道理，才是真正属于自己的智慧。",
        detail4: "【典故】李旦是唐高宗李治的儿子，当过皇帝，是为睿宗。武则天登位做了女皇帝后，李旦被贬为平民，其间和民女胡凤姣相识。民间传说，他们二人手上各有半个从胎带中取出的方印，经过‘斗印’钙明能合一，而结为夫妻。现在湖北省武汉市之鹦鹉州上还有胡凤姣墓的遗迹。楚剧：《斗印》故事"
    }, {
        id: "第二十二签",
        lv: "中签",
        title: "六郎逢救",
        content1: "旱时田里皆枯藁，谢天甘雨落淋淋;",
        content2: "花果草木皆润泽，始知一雨值千金。",
        detail1: "【卦意】此卦旱逢甘雨之象，凡事难中有救也。",
        detail2: "【解签】四周郊野的田地因为许久的干旱导致寸草不生，忽然下起了三日的雨;花果根草树芽因为甘霖的滋润而重现生机，这才知道一场雨是这么的值钱。田禾倍收，谋望相宜，病逢妙药，行人便归。此签久旱逢雨之象，凡事难中有救。灵签之日：久旱逢雨之象。简易之。遇难中有贵人救之象也。因之。凡事遇难。千万不能馁志。不能心灰意懒。垂头丧气。君汝之命中。凡逢难事。必有贵人来扶之。如行人之有阻。但贵人代之。具有行人来之效。要之。田禾能倍收。谋望相宜。病逢妙药。行人使之好运者也。",
        detail3: "【解释】此签有”无刻或忘”之意。鼓励当事人，常存慈悲心。很多事表面上看来事不关己，其实却串串相连、牵一发而动全身。小从我们周遭的人、事、物，乃扩大至国家、整个地球，都与我们息息相关，是每个人共有的责任。凡事由本身做起，秉着”人饥己饥、人溺己溺”的精神，继而落实在日常生活当中。时刻设身处地为他人着想，处处表达关怀之意。天下没有不可能的事，切勿轻视小看自己个人的力量。只要有心，无事不可成!",
        detail4: "【典故】杨六郎，宋朝时人，名杨延昭，是杨叶的第六个儿子，故称‘六郎’。时杨叶父子军队在陈家谷被番兵围困，形势危急，杨叶头撞李陵碑而死。杨七郎往取救兵被潘仁美用乱箭射死，只剩下六郎孤军作战，逃到胡原谷又逢番兵围攻，此时幸得杨五郎从五台山赶到，救了六郎，一同上五台山。《杨家将》故事"
    }, {
        id: "第二十三签",
        lv: "中签",
        title: "怀德招亲",
        content1: "欲扳仙桂入蟾宫，岂虑天门不任君;",
        content2: "忽遇一般音信好，人人欢笑领顶花。",
        detail1: "【卦意】此卦手扳仙桂之象，凡事必有贵人也。",
        detail2: "【解签】想要借由桂树爬上仙宫去，只怕天门不会就此为你开放;把所求的计划降低标准，自有高人送上山顶，指引通达的途径。商贾利益，行藏无危，病安讼理，尽可施为。此签望仙扳桂之象，凡事必遇贵人。本签为望仙扳桂之象。凡事必能遇赀人之象者。虽属上平。惟宜多作福。求神庇佑之。方有化凶趋吉之时。到头。君汝谋望一般喜讯好。高人。贵人也。日将佳音报之而来。要之。商贾者有利。行藏无危。病可安。讼可理。尽可施为。",
        detail3: "【解释】此签有”抛砖引玉”之意。提醒当事人，施比受有福。在人与人的交往中，应主动而真诚的关心他人、了解他人的需要，在自己的能力范围之内，尽力帮忙协助、不求回报。所谓”助人为快乐之本”，成就别人，也就是成就自己。对于本身所拥有的事物，不须看得太重，应能懂得取舍，不要吝于付出。无须害怕失去，应知有舍才有得。精神上的快乐充盈，绝对大于物质上的享受。",
        detail4: "【典故】高怀德，北宋开国功臣，出生于大将家庭，有武勇。宋太主赵匡胤黄袍加身，登位做皇帝后，高怀德就和匡胤的妹妹燕国长公主结婚，加驸马督尉，后和杨家将领兵征战大辽。"
    }, {
        id: "第二十四签",
        lv: "下签",
        title: "殷郊遇师",
        content1: "不成理论不成家，水性痴人似落花;",
        content2: "若问君恩须得力，到头方见事如麻。",
        detail1: "【卦意】此卦痴人道塞之象，凡事守旧待时也。",
        detail2: "【解签】本时运未至如何可以成邻成家，执迷不悟的痴人就似花落无情;孤芳自赏恐怕得不到别人的帮助，到头来仍是事情纷杂困难重重。是非莫说，事须仔细，正理存心，不伤于己。此签痴人丧德之象，凡事守旧待时。本签即是痴人丧德之象。凡事守旧待时。君汝目下即是水泡痴人似落花之命也。事事应顺天理。方平安。眼中无人之时。将何。必有福祸来临。不可不慎。亦即是到头毕竟如麻者。爰之。凡事求神作福。祷告。",
        detail3: "【解释】此签有”执迷不悟”之意。奉劝当事人，须知忠言必逆耳。看事情的角度不能光凭表面，必须多用点心，观察入微、从里到外，仔细分析评估求证。不要先入为主就认定一件事必定是如此。须知事事无绝对，很多事都有意外。对于他人的善意提醒与规劝，尤其在亲朋好友方面，应思考必定有其道理，要能谦虚接受、谨记在心。切勿亳不在乎地当成耳边风，免得吃亏在眼前，后悔莫及。",
        detail4: "【典故】殷效和殷洪两兄弟都是商朝纣王的儿子。殷效被广成子收为徒弟，学习仙法，又变得三头六臂。下山时，在师傅面前发誓，要助周文王，但走到半路被申公豹说反，欲去助作恶的父亲纣王。广成子下山劝说，师徒反脸，大战一番。后来姜子牙取得杏黄旗，在燃灯道人协助下，打败殷效，将他夹在二山之中，头露山外，广成子用犁锄犁掉他的头，以应其誓。《封神榜》故事"
    }, {
        id: "第二十五签",
        lv: "中签",
        title: "姚能受职",
        content1: "过了忧危事几重，从今再立永无空;",
        content2: "宽心自有宽心计，得遇高人立大功。",
        detail1: "【卦意】此卦古井逢泉之象，凡事贵人成就也。",
        detail2: "【解签】度过了担心危险的重重关卡，从此以后即使遇到也不会再有灾祸;放宽心顺其自然一定有因应之道，能遇高人相护顺利成功。讼中有理，病得安痊，出外求望，枯井逢泉。凡事遇贵则吉。君之签。是宽心自有宽心计。得遇高人-贵人也。方能护圣功。易言之。凡事遇贵人方能吉也。亦即能过了忧危第几重。从今再历永无凶之境。凡事谋略之时必守之。不宜盲目冲之。三思而后行。方不致吃大亏。是到头来讼中有理。病得安愈。出外求外。枯井逢泉者也。",
        detail3: "【解释】此签有”有惊无险”之意。提醒当事人，勿自乱阵脚。遇事焦急于事无补，只会让自己更加慌乱、不知所以。应能保持镇静，仔细地思考应对之道。不管做任何决定，都必须以「理智」、「冷静」为前提考虑。在自己本身方面，坚守”施恩不求报、予人不追悔”的道理。然而面对他人的协助，则要铭记在心不可或忘。不论是替你解决了实际上的困难、或帮你解开心中疑惑的人，都应该要充满感激，有机会便加以报答。",
        detail4: "【典故】姚能受职，西汉刘秀手下二十八功臣之一姚期的二儿子，姓姚（一说铫）名统字能，和大哥姚丹字刚，在京城因纠纷持械杀死了作威作福的当朝国舅。西宫郭妃因此怀恨其父子，灌醉刘秀并传唤姚期前来下牢拟予加害，并将要把姚家老少一并问斩。姚能闻迅化妆出逃至一松柏长青的古寺，身心俱疲，断了念想，不料落难时得遇神仙指点，按指教主动返城求得德高望重的父辈老臣疏劝皇上收回成命，将功赎罪父子率军去攻打叛军牛邈，军令状称若得胜则免罪，若打败则全家伏法，后姚期为帅姚能受先锋职出征奋勇杀敌终于胜利班师，皆大欢喜。传统剧目《草桥关》、《打金砖》、《汉宫惊魂》等有相关描述。“姚能受职”“姚能遇仙”等，意指虽有危难但无后患，贵人相助必得平安，可大胆向前。“姚能受职”表示遇到几次危机和烦忧的事，后来得到高人指点，成就事业。"
    }, {
        id: "第二十六签",
        lv: "中签",
        title: "钟馗得道",
        content1: "上下传来事转虚，天边接得一封书;",
        content2: "书中许我功名遂，直到终时亦是虚。",
        detail1: "【卦意】此卦虚名之象，凡事虚多少实宜守旧也。",
        detail2: "【解签】四周传来的消息总是不确实，就如天上飞来一笔文件;内容许我有大好的功名，谁知直到最后也只是虚幻一场。求闲不闲，日下心烦，欲求名利，徒尔虚投。此签接日虚望之象，凡事守旧待时。是接日虚望之象。宜守旧待时者。不可听信世人之言。宜自吾有主见。以智止谣。何必听人之者。宜向神求之。神灵加护之时。必有转机。因直待终时亦是无者。因此。守之。规谋之。待来日之计用之。易言之。求闲不闻。目下心烦。欲求名利。徒尔虚投者。",
        detail3: "【解释】此签有”误会一场”之意。奉劝当事人，凡事洞察真相。人与人相处，很容易因为对方的无心之过而造成彼此间的嫌隙。须知在事情尚未明朗之前，不应道听涂说、人云亦云，或就此否定他人。眼见不一定为凭，耳朵听到的是非也不见得是真。应保持内心的清明理智，实事求是。切忌只看表面就果断做下决定，否则很容易引起不必要的纠纷。若与人有误会，何妨自己先退一步，解释清楚、尽释前嫌。所谓”十年修得同船渡”，应当把握人与人之间相处的缘份，互相珍惜。",
        detail4: "【典故】中国古代传说人物，相传是唐朝人。生得豹头环眼，铁面虬髯，相貌丑陋，被后人奉为伏魔降妖大神，多帖在大门，以打鬼和驱除邪魔为能事。传说钟馗文武全才，唐德宗时上京会考，状元及第，但因他生相丑恶，皇帝取消他的状元资格。钟馗愤怒之极，痛骂皇帝，随后抢过武士宝剑，自刎而死。"
    }, {
        id: "第二十七签",
        lv: "中签",
        title: " 刘基谏主",
        content1: "一谋一用一番书，虑后思前不敢为;",
        content2: "时到贵人相助力，如山壁立可安居。",
        detail1: "【卦意】此卦屋好墙壁之象，凡事稳当无险也。",
        detail2: "【解签】计划谋虑用尽了机谋，思前顾后仍然不敢有所作为;顺其自然，时候到了自然会有贵人相助，就像有铜墙铁壁般的稳固可以放心安住。古花成事，寒花遇春，疑前阻滞，今得称心。此签墙有基址之象，凡事接引贵人乡。本签者。墙有基址之家。凡事接引贵人乡者。君之今也。一谋一事一番机之时。举棋不定之刻。惟君正逢贵人助也。有银墙铁壁所安靠之人。虽有贵人之签。必须慎交。方有向善之效。否则受伊人愚弄。反得败名。",
        detail3: "【解释】此签有”戒慎恐惧”之意。提醒当事人，凡事自食其力。有时人会想依附有权有势的对象，并希望”靠山”越稳越好，认为如此便可高枕无忧。但任何事绝无侥幸。故事中，李邺侯之所以坚辞所有的官职与厚禄，即是因为他心中雪亮，知道”伴君如伴虎”、树大易招风、更不愿被名与利束缚。因此不要妄想一步登天，须知”靠山山倒、靠人人倒”的道理。凡事脚踏实地，靠自己的实力来打拚。在与人合作方面，也应知见好就收，切莫贪图过多的利益，免得沉溺其中、无法收拾。",
        detail4: "【典故】刘基字伯温，是明朝朱元璋皇帝的军师。朱元璋在应天，韩林儿在安丰自称小明王，被张士诚兵士围攻，形势危急。元璋说要亲自去解围，刘基劝阻，认为会面对陈友谅攻击的危险，不可出兵。元璋军队到了安丰，才知道韩林儿已被打败，在逃亡中。这次出兵，如刘基所料，元璋军队被围攻，幸亏大将军徐达和常遇春勇力杀退敌人，才得脱险。"
    }, {
        id: "第二十八签",
        lv: "中签",
        title: "李后寻包公",
        content1: "东边月上正蝉娟，顷刻云遮亦暗存;",
        content2: "或有圆时还有缺，更言非者亦闲言",
        detail1: "【卦意】 此卦月被云遮之象，凡事昏迷未定也。",
        detail2: "【解签】月儿从东边初升正是最美的时候，突然之间乌云骤至将月亮遮蔽了半边;别说月正圆为何又遇缺，只待乌云过后缺处就会重圆。浮云遮月，不得疑惑，得待云开，自见明月。此签月被云遮之象，凡事待时。月被云遮之象。亦即是凡事。暂时且守旧。待时老。君汝之早年也。事事不遇之时。唯多年辛勤。终能入佳境。事事如意者。好景已迫眉睫。愿君多行善。亦即是言积德。以迓天庥者。君之目前即是浮云遮月不得疑惑。得待云开自见明月时。",
        detail3: "【解释】此签有”幸得援手”之意。提醒当事人，凡事以礼相待。这个社会上有各式各样的人，生活在我们周遭，有些熟悉、有些陌生。但是，即使是几乎天天见面的同学或同事，也不代表我们就能够完全了解彼此的全部。也许你自以为熟悉的对方，也仅仅只是工作上的那一小部分。也许他们各有所长，只是没有表露出来。在待人处世上，应能不分贵贱、职位高低，以礼相待。勿起分别心，凡事一视同仁。现在你身边的任何一个人，日后都有可能成为你的贵人。",
        detail4: "【典故】宋朝真宗皇帝有刘、李二妃。李妃怀孕产子，被刘妃以狸猫换太子手法陷害，被打入冷宫受罪。十多年后，李妃因日夜哭泣，在痛苦中过日子，最后双目失明。她听说包公是位公正廉洁的好官，几经辛苦，终于在天齐庙寻到包公，提出伸冤。《金丸记》传奇。《狸猫换太子》故事"
    }, {
        id: "第二十九签",
        lv: "中签",
        title: "赵子龙救阿斗",
        content1: "宝剑出匣耀光明 ，在匣全然不惹尘",
        content2: "今得贵人携出现 ，有威有势众人钦",
        detail1: "【卦意】此卦宝剑出匣之象，凡事有威有势也。",
        detail2: "【解签】 宝剑在出鞘时射出光芒，本身的锋芒当还在剑鞘中时也不会被尘垢所影响;当贵人将此剑为你取出，大可安心用来防身不用怀疑。宝剑出匣，光辉万里，贵人指出，无不赞美。此签宝剑出匣之象，凡事高人指出。本签示之曰。是宝剑出匣之象。凡事有高人指出时。必有成者。尽可防身更无疑者。时运已济。安闲守分。至卯年月。大有发展。锋芒毕露者。士子科第。仕官之人。得擢升。另言之。宝剑出匣光辉万里贵人指出。无不赞美者也",
        detail3: "【解释此签有”寻求他志”之意。鼓励当事人，专精技能。百里奚在成为”宰相”一职之前，之所以能够维生，是因为他除了学识渊博之外，还有另一项技能：饲养牲畜。因此除了本身的工作之外，不妨寻求、培养自己的第二专长。先从自己有兴趣的方面着手，不仅让生活加添乐趣，也由于是自己的喜好，更能乐在其中。或听取亲朋好友的意见，参与其它的活动。不论本身是否在行，但只要努力尝试、尽力去做，相信日久也会熟能生巧，变成自己的第二项、甚至更多项技能，不但更有保障，生活也有了更多重心。】",
        detail4: "【典故】赵云，字子龙，常山人，为刘备的猛将。时曹操欲下江南，先攻先主刘备于莘野，先主走樊城，复败于当阳，家眷失散。子龙于土墙下遇縻夫人，夫人将子阿斗托云，云将马授夫人，夫人不肯授，投井而死，云哭埋毕，怀抱阿斗，杀死曹军十多员大将，冲出重围，遇张飞在长板坡接应，救出了阿斗。"
    }, {
        id: "第三十签",
        lv: "中签",
        title: "棋盘大会",
        content1: "劝君切莫向他求 ，似鹤飞来暗箭投",
        content2: "去采薪蛇在草 ，恐遭毒口也哀愁",
        detail1: "【卦意】此卦安份守己之象，凡事小心谨防也。",
        detail2: "【解签】劝您别再有其它的想法或希求，就好像鹤鸟被暗箭埋伏而受伤;或想去砍柴却不知毒蛇暗藏在杂草中，恐怕因此而遭到毒手，实在令人担忧。闭口存舌，问事莫理，不可生心，恐伤于己。此签安身得己之象，凡事守旧则吉。本签示之曰。若去采薪蛇伏草。恐遭毒手也堪虞之命途耶。是安身得己之象。凡事暂守旧待时之者。谋事不相宜。一事无成者。田亩。六畜之不利于时。唯山坎是大吉者。易言之。闭口存舌。闲事莫理不可生心恐伤于己。",
        detail3: "【解释】此签有”误信人言”之意。奉劝当事人，应有自主的判断能力。人在犹豫不决的时候，容易降低自信，所以会转而征询他人的意见，而且希望能回答的建言越多越好。须知在遇到状况不明之时，越要保持沉着冷静。思前想后，理智地分析情势。若恐有遗漏不全之处，向他人请教虽然也是个办法，但多数人的意见，有时并不代表一定是对的。而且询问的人越多，又恐得到的答案越分歧，反而导致无所适从。对自己要有信心，不要轻易随波逐流。",
        detail4: "【典故】 唐太宗时，薛仁贵东征回来不久，又领兵西征苏宝同，被困于西唐的地方，二路元帅薛丁山（仁贵之子）与母柳氏（金定）妹金莲和程咬金等同往解围。大军到了棋盘山，遇到窦一虎劫粮，被丁山战败。窦一虎之妹窦仙童下山战薛丁山兄妹，用仙法生擒薛丁山。金莲回营报讯，程咬金知道仙童与丁山相爱，说服了柳金定，结果薛丁山与窦仙童，窦一虎与薛金莲各成亲，结为夫妻，皆大欢喜，然后一同赴西唐解薛仁贵之围。《棋盘山大会战》《薛丁山征西》故事"
    }, {
        id: "第三十一签",
        lv: "中签",
        title: "佛印会东坡",
        content1: "清闲无忧静处侩， 饱后吃茶时坐卧",
        content2: "汝下身心不用忙 ，必定不招冤与祸",
        detail1: "【卦意】此卦守旧安然之象，凡事待时则吉也。",
        detail2: "【解签】清闲无事的时候就寻找一个宁静场所安坐，饿了就吃，想睡能睡;放下身与心的束缚不去牵挂，如此必然不会遭逢灾殃与祸事啊！守己安静，即是神仙，待他时至，必定周全。此签守己安静之象，凡事宜守旧。本签曰。清闲无事静处坐。饥时吃饭困时卧。可知君尔者当守己安静之时。凡事宜守旧。不宜在此时轻举妄动。动则凶。静则吉之刻。放下身心不用忙。唯有如此。方可除去祸与殃。易言之。守己安静即是待他时之至。必定周全。",
        detail3: "【解释】此签有”思绪杂乱”之意。奉劝当事人，不要随便乱想。须知人可以有理想，但却不能有妄想。理想是实际的，已经拟好了一个方向、并想办法努力去实现。妄想则是随便的、不切实际的空想。未来的事还很难说，那何必去想”倘若”?过去的事也已经过去，又何必再执着？凭空想象的事物不可能实现，倘若执着于不切实际的幻想，只会让自己越陷越深、无法自拔。天下没有不劳而获的事，凡事脚踏实地，一分耕耘，才有一分收获。",
        detail4: "【典故】宋朝大诗人苏东坡有七个妻妾，最小的叫朝云。有一年寒冻的一天，佛印禅师来造访苏东坡，二人许久没相见，一谈就谈几个小时，越谈越高兴。夜深了，东坡就叫朝云去服侍师傅。佛印叫朝云准备了一个水壶，七个火炉，葵扇和火炭等东西，搬到房间来，并叫朝云起火，然后把水壶放在第一个火炉上煮，水滚了，又放在第二个火炉上，然后第三个火炉，至到第七个火炉，如照做几遍，直到天亮，佛印在床上入定。突然，卜的一声，水壶里的水烧干而爆裂了，佛印叫朝云不必怕，回去睡觉好了。第二天，朝云将昨夜的事告诉了东坡。东坡终于觉悟到佛印警告他：五欲不断，一定堕落。后来，佛印希望他顿悟人道，息心修行，他说：人生一世间，如白驹过隙，三二十年，功名宝贵，转眼成空，课不一律勾断，寻取自家本来面目？"
    }, {
        id: "第三十二签",
        lv: "中签",
        title: "刘备求贤",
        content1: "前程杳杳定无疑， 石中藏玉有谁知",
        content2: "一朝良匠分明剖， 始觉安然碧玉期",
        detail1: "【卦意】此卦守旧安然之象，凡事待时则吉也。",
        detail2: "【解签】前途茫无头绪不禁教人忧疑，就像粗糙的石头中内藏美玉却有谁知;等到有朝一日识货的工匠看出了端倪剖出，这才发觉深藏其中的碧玉竟是如此稀奇。玉在石中，匠手可知，直待剖出，真可施为。此签石中剖玉之象，凡事着力可成。君今之命运也。如石中剖玉之象。八百事啻要费力即可成者。易言之。汝是石中藏玉虽知。孜孜不倦中取玉之勤劳人。人生旅途中。常有惊险之象出现。易言之。玉在石中。匠手可知。直待剖出真可施。",
        detail3: "【解释】此签有”寻人捉刀”之意。奉劝当事人，凡事勿太依赖。属于自己本身份内的事，就不应麻烦别人，或干脆丢给别人去做。应能训练自己独当一面，尽量靠自己来解决问题。倘若总是希望别人来帮忙，对于本身非但无所成长，得到的收获也不是属于自己的。唯有透过亲身对事物的体验与尝试，才能有办法真正去了解其中所蕴藏的奥妙之处。选择勇敢去面对，将会发现事情其实没有想象中那么困难。",
        detail4: "【典故】刘备求贤(三顾草庐)，三国时，诸葛亮，字孔明，汉末避居南阳。诸葛亮隐居于隆中之茅屋，志学清修，养生之道，研究奇明门遁法，天文术数，卦算韬略，无所不精。初不求闻达于诸侯，后徐庶荐于刘备。先主刘备与关张三往问计，延为军师。先主即位，拜丞相，受以托孤，后主封为武卿侯。谕有宝心安，得意迟早，静待时机，不请自来。"
    }, {
        id: "第三十三签",
        lv: "中签",
        title: "咬金聘仁贵",
        content1: "内藏无价宝和珍 ，得玉何须外界寻 ",
        content2: "不如等待高人识 ，宽心犹且更宽心",
        detail1: "【卦意】此卦藏玉外觅之象，凡事待时可也。",
        detail2: "【解签】不起眼的石头内中心却是块美玉，得到了这个提点何必又向外去寻觅;等到高人慧眼将之分离剖出，正似甘霖一降扫去了杂乱纷扰的思绪。珍玉内藏，不须求觅，若遇贵人，事又得吉。此签珍玉内藏之象，凡事忍耐守旧则吉。又是珍玉内藏之象。是凡事忍耐得吉者也。君汝之今也。谋略不宜之时。乍看似机缘。行之反复为之。无一事可成。石中既有玉藏。何必向外去寻。亦即是君守于今。自有展谋之时。不宜动。动不如一静。易言之。珍玉内藏不时求。不见待若遇贵人。事则得吉。",
        detail3: "【解释】此签有”就事论事”之意。意味当事人，凡事不计前嫌。人与人相处，偶尔争吵与不快在所难免。但事过境迁之后，就无须仍耿耿于怀、记挂在心。应能不计前嫌，抛开自己心中的成见，就事论事、公私分明。对于他人的缺失，尽量包容体谅。凡事宽容以对，心胸将更为开阔。",
        detail4: "【典故】程咬金是唐朝开国元老，薛仁贵是唐太宗时大将，初时，薛仁贵二次投军都被张士贵阻挠，不被录取。这天仁贵在山上午睡，突然发现咬金路遇被虎追，仁贵赶上，打伤老虎，救了咬金。咬金欣赏仁贵武功，并给他金令箭一支，叫他去投军。第三次投军仍被张士贵欺骗，只当火头军（厨师）。《薛仁贵征东》故事"
    }, {
        id: "第三十四签",
        lv: "中签",
        title: "桃园结义",
        content1: "出入行藏礼义恭 ，言必忠良听必聪 ",
        content2: " 心下了然俱洞彻， 光明如日正当空",
        detail1: "【卦意】此卦红日当空正照之象，凡事遂意也。",
        detail2: "【解签】事言行谦恭有让不脱礼义的规范，忠言必逆耳，但听取受教必能领悟;心中明似镜一切的事物都能照见无碍，就似光明如红日当空晴朗无云。空中无事，秋水澄清，别无阻碍，自然有成。此签红日当空之象，凡事自来有成。本签也。红日当空之象。凡事自来有成。君之今也。出入行藏礼义恭。言必忠良听必聪。与友朋。长辈之交。必须礼恭。天下之事能透彻。君之运也。光明则如日正当空时。易言之。空中无事秋水澄清别无阻碍。自然有成者。",
        detail3: "【解释】此签有”事无绝对”之意。意味当事人，勿太过主观。有时人对于本身善意的想法与主张，往往十分坚持，认为只有如此才是对的。须知出发点是好意诚然可嘉，但”择善”也不能太过固执。每个人对事情的看法与解读都不一样，只要目的都是善意，可以有很多种方法，不一定非得这么做。在坚持自己理念的同时，也应虚心接受、包容学习不同的做法与意见。过于偏执只会造成自我的局限与他人的反感。所谓”信者恒信”，凡事随缘，不必强求自寻烦恼。",
        detail4: "【典故】汉献帝时，天下混乱，盗贼蜂起。刘备（玄德）关羽（云长）张飞（翼德）三人志同道合，在张飞家的桃园结拜为义兄弟，刘备为始，关羽次之，张飞为弟，三人誓说：同心协力，扶危救困，上报国家，下济黎庶。后来三顾茅庐，礼请诸葛亮下山辅佐中兴汉室，从此崭露头角，刘、关、张、三兄弟名留青史。"
    }, {
        id: "第三十五签",
        lv: "中签",
        title: "唐僧取经",
        content1: "衣冠重整旧家风， 道是无穹却有功",
        content2: "扫却当途荆棘刺 ，三人约议再和同",
        detail1: "【卦意】 此卦衣冠重整之象，凡事先难后易也。",
        detail2: "【解签】重新打点自己抛去旧有的习气，说没有功劳实则上却是有的;挥去眼前困难的阻碍，三人共同商讨必能达成共识。不须忧疑，自有期间，问前程事，更换可宜。此签衣冠重整之象，凡事改变大吉。此签是扫却当途荆棘碍。三人共议事相同者。可知重整之象。凡事改变即大吉。功名。交易均可得利。求财。时运。六畜亦均有利可图。是谋略成功。年运亨通之时。一旦称心。万事通之刻。君汝之今为不须忧虑。自有期间。前程事更换可宜。",
        detail3: "【解释】此签有”饮水思源”之意。提醒当事人，不要轻易变心弃节。有些人的耳根子软，很容易因为他人的言语而受到影响，或因眼前的美好事物而受到动摇。若遇情况不明时，要能把持内心，冷静而理智的思考，才不致于随波逐流、左右摇摆无所适从。常常回想当初的患难之情，莫忘旧情。多增进亲朋好友彼此间的互动、关怀，才能凝聚坚强的向心力。认清什么才是自己想要的，时刻提醒自己念念不忘。",
        detail4: "【典故】唐僧就是唐三藏（玄奘）法师，奉太宗皇帝命令，往西天（印度）取佛经，以宏扬佛教于东土。后来经过千辛万苦，行程十万八千里，成功取得经典回国。西游记故事，有悟空、猪八戒、沙僧三人协助唐僧往西天取经，历经九九八十一灾难，终于大功告成，功德圆满。"
    }, {
        id: "第三十六签",
        lv: "中签",
        title: "湘子遇宝",
        content1: "眼前病讼不须忧 ，宝地资财尽可求 ",
        content2: "恰似猿猴今锁脱， 自归山洞去来悠",
        detail1: "【卦意】此卦猿猴脱锁之象，凡事先难后易也。",
        detail2: "【解签】此刻的疾病官司不必哀愁，充足的资财尽可以解决问题的需求;就好似猿猴解开了身上的枷锁，得以返回仙洞来去悠游。脱除心事，且自宽舒，待他时至，路达通衢。此签系猿脱锁之象，凡事通泰。本签曰。目前病讼不须忧。实地资财尽可求。是上上之签。惟有积德。布施之举。必可更进展之机。如忽尔遇不如意之时。因君汝目下是系猿脱锁之象。凡是通泰。因此。再加修心向善。必有神佑。易言之。且自宽舒待他时至路达通衢也。",
        detail3: "【解释】此签有”居安思危”之意。提醒当事人，小心行事。人在得到帮助、好运连连或机会来临之时，往往喜不自胜、乐不可支。须知纵然目前看似稳操胜算，有势在必行之意，但切勿过于开怀狂喜，仍应时刻自我警惕”物满则溢、乐极生悲”的道理。冷静下来，仔细审慎地思考接下来该怎么做。在此同时，别忘了兼顾到别人，更不要忽略了他人的感受。应尽量保持平常心，切勿急躁，放慢脚步、顺势而为。",
        detail4: "【典故】韩湘子和吕洞宾都是八仙人物。韩湘子是唐朝人，幼而落拓，不读书，好饮酒，后被吕洞宾引渡，同入山修道，成为八仙之一。又传说，韩湘子是大文学家韩愈（文公）的侄子，韩愈不信佛道，湘子时而点化他，要他悟道。后引渡文公仙去。"
    }, {
        id: "第三十七签",
        lv: "中签",
        title: "李靖归山",
        content1: "欲待身安动泰时 ，风中灯烛不相宜",
        content2: " 不如收拾深堂坐 ，庶免光摇静处明",
        detail1: "【卦意】此卦风摇灯烛之象，凡事守常则吉也。",
        detail2: "【解签】 想解决身体健康与运势如意的疑惑，宛如风中灯烛不是好时机;莫不如安身守己静待养身，自然可以避免掉不必要的事端。静处安身，命待时泰，动心惹祸，静守急危。此签风中灯烛之象，凡事谨慎则吉。本签也。风前灯烛之签也。不相宜者。惟凡事小心。谨慎则吉也。君必须收拾深堂坐。亦即是得静为宜吉。如动则凶至。只好暂时忍耐之。时到之时。必有吉祥之象。随君而来。易言之。静处安身命待时泰。动心惹祸。静守救危耶。",
        detail3: "【解释】此签有”漠不关心”之意。提醒当事人，勿太独善其身。有些人不喜欢涉入是非，也不贪图它物，更不愿与人高攀，因此本身信誉极佳。须知本身洁身自爱又能自律是一件好事，但遇到需要帮忙或协助的情况时，也不能完全置之不理。凡事”不沾锅”的处世态度，虽然可以远离许多是非纠葛和省掉许多麻烦，但却会让人觉得过于自命清高、只顾自己不管别人，似乎有点太偏于自私。行事勿独来独往，应多与人结交相处，能帮得上忙的就尽力而为，倘若有人需要忠肯的建议，也不要吝开金口。在顾好自己的同时，请别忘了兼善天下。",
        detail4: "【典故】李靖就是封神榜里哪咤三太子的父亲，又叫“托塔李天王”，李靖父子协助姜子牙（太公）打败纣王后，建立周朝，武王正式登基。姜子牙于是设封神榜，进行封神仪式，以安定在战斗中死亡将士的亡魂。从此四海升平，天下安宁。武王要封侯行赏，又要分封土地给开国功臣。李靖父子等七人要求归山修道，不要恋栈世间的功名利禄。后来七人都“肉身成圣”，位列仙班。《封神榜》故事"
    }, {
        id: "第三十八签",
        lv: "下签",
        title: "何文秀遇难",
        content1: "月照天宅静处期 ，忽遭云雾又昏迷 ",
        content2: "宽心祈信云霞散 ，此时更改好施为",
        detail1: "【卦意】 此卦云雾遮月之象，凡事未遂守旧也。",
        detail2: "【解签】天上的明月正初出，突然之间云遮雾掩隐去了光芒;且安心静守飘云自然散去，柳暗花明前景可期。家居无忧，人口阴灾，作福保祏，又恐破财。此签浮云遮月之象，凡事守旧待时。本签为浮云遮月之象。目前事事无须如意之时亦即是劝君叵动。俟时运之来至。动之方吉利。唯有汝宽心守待。耐心待至拨云见皎洁月娘时。汝即家居无忧。人口阴灾作福。保佑之。不致有破财之时。守之。不宜不遵行。",
        detail3: "【解释】此签有”急躁武断”之意。意味当事人，小不忍则乱大谋。”忍耐”的含意很广，范围包罗万象，不单只是表面上的形容。”忍耐”是积极的、勇敢的、坚强的、乐观的、真心的。举历史故事的例子来说：『刘琨闻鸡起舞』，是积极的忍耐。『宰相萧何追韩信』，是勇敢的忍耐。『程婴忍辱匿孤』，是坚强的忍耐。『诸葛亮隐居卧龙冈』，是乐观的忍耐。『郭子仪免冑见回纥』，是真心的忍耐。藉由忍耐，时时刻刻考验我们的心性，并激荡出无比的智慧。凡事忍耐，并不间断地充实自我本身的学识。",
        detail4: "【典故】《何文秀玉钗记》，传奇剧本故事。穷书生何文秀同富家女王琼珍相爱，出奔海宁，何文秀被土谊陷害，王琼珍剪发毁容，历经各种痛苦灾难，坚不再嫁，二人终得重聚，结为夫妻"
    }, {
        id: "第三十九签",
        lv: "下签",
        title: "姜女寻夫",
        content1: "天边消息实难思， 切莫多心望强求 ",
        content2: " 若把石头磨作镜 ，曾知枉费己功夫",
        detail1: "【卦意】此卦守常安静之象，凡事守己则吉也。",
        detail2: "【解签】 就像未知的事情难以预料，别只顾自己有所强求;就好像想用石头来磨成一面明镜，恐怕耗尽精神心力也只是徒然。千般用计，一旦皆空，安静守旧，不必强求。此签安静守旧之象。本签告之于弟子曰。若把石头磨成镜。精神枉费一时休之安静守旧之象也。一切事宜皆在低潮中。宜小心。小心。如六畜之损。田亩之亏。宜拾旧图新。适合时潮。方能振兴起色。六甲生女亦不必气馁。宜积德。修身为先。必有赖之。易言之。千般用计届时皆空心守旧。不必强求者。",
        detail3: "【解释】此签有”积怨难消”之意。奉劝当事人，勿存心不良。有些人一旦受到不留情的指责或羞辱，就会觉得难以忍受、恼羞成怒。为了达到报复的目的，甚至想利用不相干的人。须知在愤怒当头时，很容易失去理智，产生不好的念头，做出失当的行为。当思”说者无心”，宽容原谅。有些话听过就算了，实在不必因此而耿耿于怀、把自己气得半死，更不应怀恨在心、挟怨报复。另外，自己本身的事，切勿牵连到不相干的人身上。所谓”己所不欲，勿施于人”。",
        detail4: "【典故】秦始皇为了防卫国土，动用了五十万农民，在北方建筑长城，万喜良和孟姜女是对新婚夫妇。丈夫被召去建长城，多年不回家，亦无音信，孟姜女为了寻找丈夫，千山万水，走到了人们在建长城的地方，她知道丈夫在工作中死了，悲痛万分，号啕大哭，哭声震动大地，连长城也在这时倒塌了一段。"
    }, {
        id: "第四十签",
        lv: "中签",
        title: "武则天登位",
        content1: "红轮西坠兔东升， 阴长阳消百事亨 ",
        content2: "是若女人宜望用 ，增添财禄福其心",
        detail1: "【卦意】此卦阴长阳消之象，凡事先难后易也。",
        detail2: "【解签】太阳西下月亮就东升，阴生阳失是两者间的状态显现;倘若女人求占得到此一卦象，即称心如意福禄增添。阴利女人，不宜男子，若问求望，无忧后喜。此签阴长阳消之象，凡事先难后吉。本签是阴长阳消之家。凡事先难后吉者。不管是交易。求财。时运。均在开始时。均为不利。但是因一己之奋斗。苦心造诣。终有出头之日。所幸田亩大收。六畜兴旺。皆是祈福所赐。疾病。皆有险。宜小心。易言之。阴利女人。不宜男子。若问求望。无忧从喜。",
        detail3: "【解释】此签有”知礼尽孝”之意。意味当事人，不论男女，都应知礼法、尽孝道。孔子说：”非礼勿视、非礼勿言、非礼勿听、非礼勿动。”人必须约束自己的行为举止，凡事都不应越矩。现今电视节目、电影、网络、书籍等，会污染身心产生妄想邪念的，不应看。不道人之短，不说己之长，不过问别人的隐私。别人在说八卦、私事，不关自己的事，避得远远的，不听。不做违反道德良心的事。凡事真诚、尊重、为他人着想，即是知礼。尽孝道是做人的根本，莫忘父母生养之恩，凡事勿让父母操心，时刻挂念、问候关心，而不只是在金钱上的供养。守礼尽孝是道德的根本，不会因为时代变迁而有所改变。",
        detail4: "【典故】武则天是中国历史上唯一的女皇帝。唐高宗（太宗之子）即位不久，她就做了皇后。高宗病死，她以太后身份临时执政，公元六九○年，她六十七岁时，正式登位做女皇帝，改国号为‘周’。她只做了十五年皇帝，八十二岁高龄，被迫退位，由李氏复兴唐朝。"
    }, {
        id: "第四十一签",
        lv: "下签",
        title: "董卓收吕布",
        content1: "无限好言君记取 ，却为认贼将作子",
        content2: "莫贪眼下有些甜 ，更虑他年前样看",
        detail1: "【卦意】此卦认贼做子之象，凡事认假作真也。",
        detail2: "【解签】事事无绝对的道理你必须要谨记，就好像目前认贼人为子一样;不要只看到眼前的利益就急着贪求，岂知日后还得要担忧受苦。只道一着，君子莫错，宰把身心，不致耽搁。此签认贼为子之象，凡事不宜苟且。本签示于弟子曰。认贼为子之象。不宜苟且者。神戒之曰。莫贪眼下有些甜头。趋之。后果堪虞。到头来还是受苦者。功名。交易。尚不理想。求财皆在待时之命运。为认贼作子之时。易言之。只道一着君子莫错宰把身心不致耽搁。",
        detail3: "【解释】此签有”贪多必失”之意。奉劝当事人，凡事要懂得节制。对于目前所拥有的，应知好好珍惜、谨慎运用。牢牢把持身心，勿让欲望无止尽的扩大。当知满足现状，切忌还想要更多更多。行事勿过于骄纵奢华，勿沈迷于酒色财气之中。否则纵有金山银山，转眼也会成空。不要妄想把全部的东西都想要占为己有。不属于自己的物事，不必强求。",
        detail4: "【典故】董卓是东汉末年的大军阀，他残忍暴戾，独断独横，杀人不眨眼。到了长安，又搜刮民财，强取豪夺，令人民愤怒。吕布是个骁勇异常的年轻人，但没有品德，有勇无谋。董卓以一匹良马和许多金钱收买了吕布归顺，后来又认吕布为义子。吕布在凤仪亭调戏董卓爱妾貂禅，导致二人结怨，董卓终被吕布所杀。《三国演义》故事"
    }, {
        id: "第四十二签",
        lv: "上签",
        title: "有莲见母",
        content1: "君皇圣后终为恩，复待祈禳无损增 ",
        content2: " 一切有情皆受用 ，人间天上得期亨 ",
        detail1: "【卦意】此卦天垂恩泽之象，凡事成就大吉也。 ",
        detail2: "【解签】你施予的恩泽利益众人无数，又公正无私的祈祷上天赐给大众粮食;一切有情都因此受益无穷，得到甚大的好处与方便而得以周全。天降甘露，君子莫忘，求谋成就，和合吉昌。此签天垂甘露之象，凡事大吉利也。本签示之曰。天垂甘露之泉。凡事大吉利者。亦即是先难后易者所得。功名成。交易就。婚姻虽平庸。但是难得之缘也。时运至冬季即至。六畜。田亩皆旺之时。宜勤俭。千万不得浪透。陷已于绝境者。易言之。天降甘露。君子莫忘求谋成就。和合吉昌之签也。",
        detail3: "【解释】此签有”顺势而为”之意。提醒当事人，凡事不要太固执。须知出于善意的做法没有什么不好，但要能审时度势，视情况来推动。勿立刻急于改变现状，而忽略了旧有的行为模式。对于旧有的模式，应仔细评估衡量，去芜存菁、再加上自己的新理念，或可让事情更臻完满。自己的想法固然没错，仍然可以听听别人的意见，对于旁人恳切的建言，要能虚心接受，慎重思考。切忌带着个人的偏见、只为了反对而反对。 ",
        detail4: "【典故】目莲是佛门的尊者，有神通。他的母亲作恶多端，死后在地狱的鬼道受苦，目莲没法救渡母亲，求助于佛祖，也没办法。佛祖唯有叫目莲设兰盆会，供养十方僧侣，并由诸天菩萨施法，救渡地狱中的母亲。由是农历七月十五日为盂兰节，亦即孝亲节。后又演变为七月的“中元普渡”。佛经故事。"
    }, {
        id: "第四十三签",
        lv: "上签",
        title: "行者得道",
        content1: "天地变通万物全 ，自营自养自安然",
        content2: "生罗万象皆精彩 ，事事如心谢圣贤 ",
        detail1: "【卦意】此卦天地交泰之象，凡事大吉无危也。",
        detail2: "【解签】天地顺适安泰万物欣欣向荣，本身各有各的形貌显现安定怡然的神色;这种种现象繁多却漂亮地呈现在眼前，象征着事事和谐称心如意。天生万物，谋望皆新，福德积聚，瑞气添增。此签天地交泰之象，凡事遇贵。本签为天地交泰之象。是事事和谐得称人者。季冬有喜。交春之时。人事遂意者。必是喜事连连之人。万象新之时。自形自色自怡神。事事吉祥之际遇。相机而动者。易言之。本签者天生万物谋望皆新福德积聚瑞气添增。可喜之签也。",
        detail3: "【解释】此签有”不拘小节”之意。提醒当事人，不要太吹毛求疵。有些人除了对自己很严格、对别人也很挑剔，凡事都要求十全十美，尤其重视细节。须知对于自己本身，过度要求完美，反而会放不开、形成一种无形的精神压力。而在待人处世上，更应有容人的雅量。所谓”人非圣贤，孰能无过?”。每个人都有个性上的小小缺失，但只要不影响大局，又何必在意?不要刻意挑三捡四，硬把自己的想法与要求加诸在别人身上，否则容易导致旁人无法忍受。成大事者只放眼大处，不拘泥细节。 ",
        detail4: "【典故】行者就是孙悟空，初时飘洋过海，从花果山到三星洞向菩提祖师学道。悟空心窍玲珑，学功夫却诸多挑剔，祖师因此生气，罚打手心三下，他就悟出祖师暗示，半夜三更从后门摸到祖师塌前，要求传道，因而学得七十七变化等神通及长生不老之术。《西游记》故事"
    }, {
        id: "第四十四签",
        lv: "中签",
        title: "姜维邓艾斗阵",
        content1: "棋逢敌手着相宜， 黑白盘中未决时",
        content2: "皆因一着知胜败 ，须教自有好推宜",
        detail1: "【卦意】此卦棋逢敌手之象，凡事用机关则吉也。",
        detail2: "【解签】下棋时遇到实力相当的对手应该更小心，此刻仍然拿不定主意;想要知道最后到底谁胜谁负，必定是能掌握机先，抢在前头的人。欺求心事，如同着棋，要知胜负，先着莫疑。此签棋逢敌手之象，凡事先吉。本签为棋逢敌手之象也。凡事先吉。凡未小心。节俭则有转恶之嫌。宜小心为之。棋逢敌手之时。必藏有机。决定胜负之时莫迟疑。认为可行则毫不犹豫之下即可。尤应和者。善有善报。恶有恶报。示人早知觉悟多作善。方能有善报者。",
        detail3: "【解释】此签有”多方思考”之意。意味当事人，谋定而后动。在面对事情时，不论大小，要能从里到外、仔细地分析判断。保持清明的理智与思路，冷静而缜密地假设任何可能发生的状况，模拟并想出因应之道。眼观四路、耳听八方，着眼大处时，也要兼顾细节。另外，在情况不佳而本身又处于较不利的弱势时，倘若想硬碰硬，无异以卵击石，绝对没有好处。不妨请教志同道合的人，共同商议。借着众人集思广益所想出的办法，也较能万无一失。大家有志一同、互相砥砺，相信定能扭转颓势、迎向成功之路。",
        detail4: "【典故】三国故事：姜维是蜀国猛将，邓艾是魏国（司马昭）大将，姜维出兵伐魏，双方军队会师于祈山之前。首先姜维摆了阵势，乃是诸葛亮之法，邓艾以十万兵士冲击，皆被打败，次日，姜维摆八卦阵，邓艾也摆八卦阵，复变为八八六十四门户，姜维军进入阵内，变为长索卷地阵，邓艾不能破，被困在中间，幸得司马望赶来救出。《三国演义》故事 "
    }, {
        id: "第四十五签",
        lv: "上签",
        title: "仁宗遇仙",
        content1: "温柔自古胜刚强 ，积善之门大吉昌 ",
        content2: "若是有人占此卦 ，宛如正渴遇瑶浆",
        detail1: "【卦意】此卦积善温柔之象，凡事贵人和合也。",
        detail2: "【解签】温柔本身必定比刚强占优势，多行善事必定有利;倘若有人求占得到此卦，就好似饮下琼浆止住了饥渴。天地有感，应验十分，佛神保佑，得福寿长。此签积福门庭之象，凡事营谋则吉。本签为积福门庭之象。凡事谋则吉者也。灵签曰。温柔自是胜强刚。积善于门大吉昌。为使己之事务。求财。时运吉昌者。必须积善。修德。布施。方能亨之。久而弥坚。易言之。天地有感应验十分佛神保持得福寿长之签。",
        detail3: "【解释】此签有”千锤百炼”之意。勉励当事人，凡事要禁得起考验。在人生中有一道一道的关卡，会遭遇到很多种情况，都是为了让我们能增长智慧、磨练心性。其中，当然也要学习忍耐。所谓”玉不琢、不成器”，越是可造之才，碰到的挫折与屈辱也会越多。乐观地换个角度想，很多事都只是一种过程，而你比别人多了更多的机会去体验，未尝不是好事。现在你极痛恨的人，说不定日后却是你最感激的人呢。有句话说：”不合理的要求是磨练”。凡事若能忍一时，将来必定受用无穷。 ",
        detail4: "【典故】宋朝真宗的李妃生下了太子，被刘妃和郭槐合谋陷害，以一只狸猫换掉太子，李妃因此被打入冷宫受，后又逃到赵州桥，住在寒窑，过着痛苦生活，日夜哭泣，终致双目失明。刚出生的太子幸得被太监陈琳和宫女寇珠救出，秘密寄养八王爷家中，终为八王爷第三儿子，取名赵桢。六岁时，因真宗无子，又被送到宫中留养，太子聪明灵活，很得真宗宠爱，册封为太子，真宗归天，台子即位，是为仁宗。十八年后，李后（李妃）在天齐庙寻到包公，提出伸冤，英明的包公，探讨了事情的真相，决心设法平反，使皇帝母子相会。仁宗于是在八王爷等安排下，在南清宫会见了李后，母子相认，抱头痛哭。 "
    }, {
        id: "第四十六签",
        lv: "中签",
        title: "渭水钓鱼",
        content1: "勤君耐守旧生涯 ，把定心肠勿起歹 ",
        content2: "直待有人轻着力， 枯枝老树再生花 ",
        detail1: "【卦意】此卦枯木生花之象，凡事自有成就也。 ",
        detail2: "【解签】劝你遵循保持以往的步调，安固身心切勿听取不正当的事理;直到有人行方便助你一臂之力，就像满园枯木逢春再开花。变心守旧，时至成就，行则多逆，安静无忧。此签枯木生花之象，凡事待时则吉。本签为枯木生花之家。即是万物逢春复苏之象。君尔多年辛劳得报于斯时。惟早植因缘。必有喜事连连。诗日：劝君耐守旧生涯。爰之。君之今宜静。不宜动。动则凶。静则吉。亦方能枯木再开花。向使逢遇贵人。可攀之。伊者后日之诸侯。易言之。决心守旧时至成就行多多逆。安静无忧。",
        detail3: "【解释】此签有”随缘自在”之意。意味当事人，人贵自立。很多成功且耳熟能详的人，在尚未成名之前，都只是个平凡而普通的小百姓。他们甚至没有料想到自己会成功。所以不必因为默默无名、或人微言轻而感到沮丧或自卑。毋须羡慕别人，应当知福惜福，坦然乐观地看待现状。每个人的价值观与人生观都不同，不要被别人的言语影响而导致心中摇摆不定。只要固守本分、一心向善，事情不论大小，只要是对的，就尽力去配合，努力把它做好。凡事尽心自律、无愧于心，必有机缘到时、一显身手之日。 ",
        detail4: "【典故】姜子牙火烧琵琶精后，在朝歌谋事，不久弃官，别了妻子马氏，土遁救了居民，一个人到渭水钓鱼过日子。子牙一意守时侯命，不管闲非，日诵《黄庭》，悟道修真。苦闷时，持丝轮倚绿柳而垂钓。后来周文王夜梦飞熊，亲自到渭水礼请子牙出来治国，并封为丞相，时子牙已近八十岁了。姜子牙即姜太公。钓鱼地点：今陕西省宝鸡番溪河畔。 "
    }, {
        id: "第四十七签",
        lv: "上签",
        title: "梁灏登科",
        content1: "锦上添花色愈鲜 ，运来禄马喜双全 ",
        content2: "时人莫恨功名晚 ，一举登科四海传 ",
        detail1: "【卦意】此卦锦上添花之象，凡事大吉大利也。 ",
        detail2: "【解签】犹如彩色花纹的织品上加了朵花儿更添鲜艳，时候至时好运官禄连连令人称贺;现在的人不必惊异功名迟晚，金榜题名之际天下皆知且广为流传。儿有双亲，守时待庆，遂平生志，都来自命。此签福禄双全之象，凡事兴隆大吉。本签者。福禄双全之象者。凡事兴隆大吉之签。曰锦上添花色更鲜。运来之时也喜双全。八十二对大魁。不是晚也。奉献社会人群。积吾德。荫子孙。何乐不为。为天数之所赐。宜再积德。方有同点灯之故。易言之。儿有双亲。守时待庆遂平生志。都来自命。",
        detail3: "【解释】此签有”努力向上”之意。鼓励当事人，凡事力图振作。人最怕光说不练、或立定志向后，又轻易退缩、不能坚持到底。须知任何事只要有决心，就无须担忧起步太晚、或觉得不可能、更不要想”放弃”的念头。时时刻刻自我砥砺，朝着目标努力、再努力。所谓”天下无难事，只怕有心人”。切勿半途而废，只要抱着希望、努力不懈地持之以恒，如此成功之日，想必也不远了。 ",
        detail4: "【典故】梁灏是北宋时代山东人，字太素。雍熙年（宋太宗）进士，二十三岁登科状元。后人传说梁灏八十岁中状元。 "
    }, {
        id: "第四十八签",
        lv: "中签",
        title: "韩信挂帅",
        content1: "昆鸟秋来化作鹏， 好游快乐喜飞腾",
        content2: "翱翔万里云霄去， 余外诸禽终不能 ",
        detail1: "【卦意】此卦鲲鹏兴变之象，凡事有变动大吉也。 ",
        detail2: "【解签】鹍乌在秋天的时节转变为大鹏鸟，尽情得意飞升翱翔;亳无阻碍直上万里之外，听凭众多禽鸟终究无法相比。鹍鸟化鹏，诸禽不能，桂花时节，财禄百成。此签鹍鸟化鹏之象，凡事兴隆大吉。本签为鹍乌化鹏之吉象也。凡事皆能兴隆大吉。功名成之。利得之。婚合之。六畜旺之。六甲全之。官事。等等。无一不顺利也。直冲云霄之外。无可与伦比者。惟逢此佳境。勿忘今之所由成。积德。布施之再行者。可维护君尔之谋望无疑。易言之。今之君也。桂花时节财禄成此。",
        detail3: "【解释】此签有”胆大心细”之意。提醒当事人，智勇兼俱。有些人够勇敢，但不够细心。有些人够细心，却又不够勇敢。那么要如何”有勇有谋”呢？其实平日若能深入细心地观察周遭，就能发现人事物之中细微巧妙的变化，也可以早一步掌握先机、提前准备行动。凡事仔细用心思考，判断事情的轻重缓急。一旦下了决定之后，就不要再犹豫不决，试着勇敢放手一搏。倘若因迟疑再三而畏畏缩缩、导致错失良机，岂不叫人徒呼可惜。 ",
        detail4: "【典故】韩信是汉朝初年三杰之一。贫农出身，初在项羽（楚霸王）军中，不得志。后归刘邦，丞相萧何发现韩信很有才华，三番四次推荐他为元帅，但刘邦不肯。韩信在失望之下，骑马出走。萧何知道了，即刻策马星夜追赶韩信回来，这次说服了刘邦，封他为元帅，并设坛举行隆重挂帅仪式。韩信将兵，多多益善，证明了他的军事才华。后被吕后所杀。"
    }, {
        id: "第四十九签",
        lv: "中签",
        title: "王祥求鲤",
        content1: "天寒地冻水成冰， 何须贪吝取功名",
        content2: "只好守己静处坐 待叶兴盛自然明",
        detail1: "【卦意】此卦水结成冰之象，凡事不用枉求也。",
        detail2: "【解签】谋求众多的作为最终仍然冰溶于水，又何必贪图不轨深受其苦;唯一的办法只有静心安份守己;等到事情发生转变后自然能消除你之前种种的疑惑。水冻成冰，冰还溶水，若问营谋，何如不理。此签如冰还原之象，凡事只宜苦守。",
        detail3: "【解释】此签有”自寻死路”之意。奉劝当事人，莫心怀不轨。有些人表面上对别人很好，但其实心里满是害人的念头，只是隐藏的很好，看不出来而已。须知此举也许可以骗得过旁人，但终究骗不了自己。表里不一的人是很痛苦的，有时说了谎，却又怕被揭穿，于是再说一个谎。如此恶性循环，提心吊胆。但是内心交战，知道是”明知不可为而为之”。这种良知的谴责，岂不是自我折磨、苦不堪言？所谓”害人之心不可有”。凡事要能行得正、坐得稳，勿存妄想邪念，免得害人又害己。 ",
        detail4: "【典故】王祥是晋朝时代人，古代孝子之一，他十分孝顺父母，村里人人称赞他的孝顺行为。母亲死后，父亲再娶，继母对待王祥十分刻薄，一天继母生病，要吃鲤鱼，叫王祥去找，进值冬天，天寒地冻，鱼儿都躲在冰底下了，王祥找不到鱼，只好睡在冰河上，因其孝心感动了天，鲤鱼破冰而出，王祥终有所获。 "
    }, {
        id: "第五十签",
        lv: "中签",
        title: "陶朱归五湖",
        content1: "五湖四海任君行， 高挂帆蓬自在撑 ",
        content2: "若得顺风随即至 ，满船宝贝喜层层 ",
        detail1: "【卦意】此卦顺风撑船之象，凡事皆顺大吉也。 ",
        detail2: "【解签】五湖四海都可以驾船遨游，扬起风帆稳住船舵;所到之处皆能得到顺风相送，船上满满的收获令人欢心喜悦。自在优游，不须着力，财源重重，无不惟悦。此签顺风行船之象，凡事和合大吉。本签曰。五湖四海尽行船。高挂风帆把舵坚。如三宝太监。郑和之行之于南洋也。只要把舵牢住。必可扬德威于异域者。为顺风行船之象。凡事和合大吉者。虽大吉之签。百事兴。唯必留心正应。反应之不同。易言之。本签者自在优游。不须着力。财源重重。无不惟悦者。",
        detail3: "【解释】此签有”友善关怀”之意。提醒当事人，互助互动。即使本身事情再多、再忙，也不能忽略了与周遭旁人跟亲朋好友间的联系交流。透过本身发自于内心的真挚恳切，旁人必能感受到善意与温暖。这种内心的真实感受，胜过外在的一切有形物质。凡事由本身做起，藉由诚恳的表达与关心，自己与他人之间，在无形中也递增了互信互助的情谊，因此而更加团结、更加和谐。",
        detail4: "【典故】陶朱公原名范蠡，春秋时代人，初和越王勾践做事，后来发现勾践是个只能共患难而不能共享安乐的人，就毅然离开了他，坐船飘行到五湖去了。到了齐国叫陶的地方，他改名为陶朱公，从事耕种和做买卖生意，不久积蓄了许多钱成为巨富。后人以陶朱公为生意成功的典范。 "
    }, {
        id: "第五十一签",
        lv: "上签",
        title: "孔明入川",
        content1: "夏日炎天日最长， 人人愁热闷十分 ",
        content2: "天地也解知人意 ，熏风拂拂自然凉 ",
        detail1: "【卦意】此卦人人愁热之象，凡事随心从意也。 ",
        detail2: "【解签】夏天刚刚来临，白天的时间变得比较长，人们都因为过于炎热而感到烦闷不爽;其实上天也明白众人的心意，因此派遣南风专门送来凉爽。进用莫疑，佳期日至，凡成谋望，不须忧虑。此签炎天生凉之象，凡事所谋稳当。本签之诗也。炎天生凉之象。凡事所谋稳当者。虽是中平之签。人生之乐在于此。凡事知足之时即大安。谋事不宜因小嫌弃。改大则败者。一石拾之嫌小。舍之。再拾之。无一而足者。到头无石可捡。易言之。进用莫疑。最佳期日至。凡成谋望。不须忧虑。",
        detail3: "【解释】此签有”坦然面对”之意。提醒当事人，知己知彼。倘若能够有自知之明，在面对问题的时候，不会选择逃避，也不会冒然有所行动。仔细分析自己的优势与弱势，就能找出适合自己的志向、又能发挥所长之处。知道该怎么努力才能成功;面对挫折与失败，也会勇于承认接受、彻底的自我检讨改进。先知己后才能知彼，再谨慎地审时度势，必能如鱼得水，前景可期。 ",
        detail4: "【典故】益州（西川）由刘璋占据，北方张鲁要攻打西川，刘璋大忧，在谋臣张松的大力劝说下，刘璋答应让刘备进驻西川，帮助他抵抗张鲁。部下极力反对，但刘璋坚决要请刘备到来，因刘备是同宗，绝无恶意。因此是年冬月，孔明和刘备率领军队进入西川。西川最后归刘备。（西川即今四川省西部）《三国演义》。 "
    }, {
        id: "第五十二签",
        lv: "中签",
        title: "太白醉捞明月",
        content1: "水中捉月费功夫 ，费尽功夫却又无",
        content2: "莫说闲言并乱语 ，枉劳心力强身枯孤",
        detail1: "【卦意】此卦贪求费力之象，凡事劳心费力也。 ",
        detail2: "【解签】犹如费工夫想要捞起在水中的月亮，耗尽了方法仍是一场空;别再听信流言和不真实的话语，枉费心思力气，最终想要谋取的事物终究难以如愿。讹言莫信，费力劳心，家宅不利，不可妄行。此签水中捉月之象，凡事所为不利。水中捉月之象。凡事所为不利。在水中捞月亮很费工夫。但是费尽工夫却又捞不到。不要相信闲言和没有根据的言论。白白用心。做事也不能完成目标。易言之。讹言莫信。费力劳心。家宅不利。不可妄行。",
        detail3: "【解释】此签有”枉费心力”之意。奉劝当事人，眼见不一定为凭。须知社会上很多种现象都是真真假假、假假真真。有时眼里看到的、耳里听见的，都可能只是表面，甚或是一种假象。是、非、真、假，唯有靠智慧来判断。在做任何事之前，一定要经过仔细的思考与再三的求证。莫被一时的假象所迷惑，也不要立刻就信以为真、冒失行动，结果恐导致白忙一场，只是徒劳心力而已。 ",
        detail4: "【典故】李太白是唐朝诗仙，写了许多诗和文章，流传后世。太白喜欢喝酒，被称为酒仙。六十二岁死，传说当时他喝得酩酊大醉，走上船去，看见水里有月，他跳下水去捞月，结果溺死，后来人有说看到飞来一条鲸鱼，上面骑着一位白衣仙人，飞到天上月宫去了，那白衣仙人就是李太白。"
    }, {
        id: "第五十三签",
        lv: "中签",
        title: "刘备招亲",
        content1: "失意番成得意时 ，龙吟虎啸两相宜",
        content2: "青天自有通霄路 ，许我功名再有期 ",
        detail1: "【卦意】此卦龙吟虎啸之象，凡事顺意有望也。 ",
        detail2: "【解签】从前的失意已转变为得意，犹如龙吟虎啸两相得宜;平步青云、大道亨通的日子终将会来临，届时盼望的功名利禄必然也能如愿以偿。教去即去，教住即住，口有亨通，到头必利。此签龙吟虎啸之象，凡事求谋吉昌。本签为龙吟虎啸之象也。凡事谋略之。吉昌者也。失意翻成得意时。黑暗之去也黎明至。光明也。于是青云中有路。终于到。天神允我功名可期。易言之。教去即去教。住即住口有亨通到头必利者。一片虔诚祈保之。必有帮助于君尔。",
        detail3: "【解释】此签有”收放自如”之意。提醒当事人，凡事适度地拿捏分寸。有时人往往太在意别人对自己的看法，所以刻意保持身段，却因此放不开，说话做事也相对地被局限。有时人却因为太过随性，反而变成我行我素，又会让人觉得放肆且不知礼法。其实该严肃时就要严肃，不要仍然嘻皮笑脸、东张西望，会让人觉得举止轻浮、三心二意。该放松时就要放松，不要一昧墨守成规、过于拘谨，又会让人觉得难以相处、不知变通。应视情况场合，调整本身的行为举止。说该说的话，做该做的事。",
        detail4: "【典故】三国时，蜀主刘备因借荆州不还，东吴周瑜向孙权献计，把孙权的妹妹嫁给刘备，但一定要刘备过江来招亲，然后把刘备软禁起来不放。可是刘备得到孔明的锦囊妙计，又有赵子龙保护着，在江东招亲，安然无事。过了一些日子，说服了孙夫人，不辞而别，离开东吴。诗曰：《周郎妙计安天下，赔了夫人又折兵》。 "
    }, {
        id: "第五十四签",
        lv: "下签",
        title: "马超追曹",
        content1: "梦中得宝醒来无 ，自谓南山只是锄",
        content2: "若问婚姻并问病 ，别寻来路为相扶 ",
        detail1: "【卦意】此卦梦中得宝之象，凡事枉费心力也。 ",
        detail2: "【解签】在梦中获取了珍贵的宝贝，醒来时却空无一物，应知犹如巫山云雨般不过是场虚幻;想要知道婚姻与疾病诉讼的吉凶？还不如换个想法与途径较务实吧。如水中月，形短形长，皆由分定，何必商量。此签梦中得宝之象，凡事多虚少实。本签曰。梦中得宝醒来无。可知君之谋望。均归虚者也。功名。交易。婚姻。求财等。皆守旧方可。目下之所由成者积德。修身之不足所由生。爰之。更在修阴骘方面多下功夫。必有转机之时。前程方可远大。易言之。本签也。戒人去恶从善。趋吉化凶者也。",
        detail3: "【解释】此签有”南柯一梦”之意。奉劝当事人，勿痴心妄想。人常感叹自己时运不济，又冀求功名富贵，希望一切应有尽有，好满足自身的欲望。因此常常幻想，日日做着发财梦、升迁梦，渴望有朝一日真能实现。疏不知人生如梦、得失无常，富贵荣华也只是一时的虚幻，转眼便成过眼烟云。奉劝当事人，与其空无的痴心幻想，还不如脚踏实地、诚恳务实的做好自己的本份。好运不会凭空而来，凡事有付出才有收获，知足即是福。 ",
        detail4: "【典故】三国时，马超驻守西凉洲，获悉父亲马腾被曹操杀害，即刻起二十万大军，直奔长安，攻打曹操。西凉兵攻克长安，再捣潼关。马超遇到曹操，仇人相间，分外眼红。双方展开激战西凉兵勇猛异常，曹军大败，曹操在乱军中逃命，马超追赶，士兵们高喊捉拿曹操。为了不被认出，曹操至好脱下锦袍丢掉，有用剑割短了胡须，骑着马向前狼狈逃窜，这时幸得曹洪赶到相救，曹操终于得命走脱。《三国演义》故事。"
    }, {
        id: "第五十五签",
        lv: "中签",
        title: "周武王登位",
        content1: "父贤传子子传孙， 衣食丰隆只靠天 ",
        content2: "堂上椿萱人快乐， 饥饭渴饮困时眠 ",
        detail1: "【卦意】此卦接竹引泉之象，凡事谋望大吉也。",
        detail2: "【解签】世代传承子孙优秀贤能，衣食无缺富贵在天;金玉满堂无忧无虑自然舒爽，饿了就吃，倦了就眠的生活必然适意。祖宗积德，福禄后昆，荣禄并耀，光裕门庭。此签接竹引泉之象，凡事着谋吉利。本签示于弟子曰。子孙贤。衣禄丰盈富在天。君尔之命。即是富贵天定者。大吉大利之签者。功名。交易。婚姻。求财皆如意者。而且吃饭困时眠之运。逢此大吉利之时。宜多修德。积善。更可发扬光大者。",
        detail3: "【解释】此签有”失控惹祸”之意。提醒当事人，遇事不宜意气用事。有时人与人之间难免意见不合而发生争执口角。须知冲动于事无补，无论对方是否有错在先，但倘若因此而忍不下一口气、非要争个理出来，却可能导致撕破脸不相往来、见面又尴尬的局面，甚至拖累到不相干的人替你收拾残局。这都是因为欠缺理智且没有顾虑到后果所造成的影响。俗云：”冤家宜解不宜结”。与其吵得面红耳赤闹得不可开交，还不如冷静下来，想个好方法，既不会伤害到对方，又可以避免让事情重蹈覆辙。心平气和解决问题，而非制造问题。",
        detail4: "【典故】周武王（文王之子）在尚父姜子牙辅助下，击败了可恶的纣王，纣王在摘星楼上焚火自杀，结束商朝统治。子牙（太公）于是建设楼台，拜祭天地，周武王正式登王位，是为周朝元年壬辰。次日又设鹿台，将钱财分散给人民，以资庆祝。周朝在历史上有八百年的统治。 "
    }, {
        id: "第五十六签",
        lv: "中签",
        title: "禄山谋反",
        content1: "滩小石溪流水响 ，风清明月贵人忙 ",
        content2: "路须借问何方去 ，莫取林中花草香 ",
        detail1: "【卦意】 此卦船行小滩之象，凡事有贵人助也。 ",
        detail2: "【解签】溪涧窄小又暗藏巨大的石块，使得流水经过时都发出激响，这样的情况下辛苦拚力前进恐怕会导致船体因此受到损伤;倘若能够找出更适合的途径，如此才可风平浪静无所阻碍。涧水滩多，掌船劳力，指出前江，风帆顺得。此签涧水行船之象，凡事先难后易。本签是涧水行船之象。是凡事先难后吉者。虽是君尔力劳撑驾。恐有损伤。先是劳而无功。路顺指出前江去。自有风静浪平。一路顺风之时。必须更修身。积善。布施。天心感应之时。必有更上一层之列。易言之。涧小滩多掌船劳力指出前江风帆顺得。",
        detail3: "【解释】此签有”功成身退”之意。意味当事人，凡事见好就收。任何事情在成功之前，都会经过努力的打拚、付出大量的心血，才能得到丰硕的成果。但在任务完成、功成名就之后，如何”见好就收”，才是最困难的考验。须知万事万物都没有一定的准则，既无法预料，也无从掌控。事情来了，就去面对，尽力去做，做完了，就要放下。凡事不要留存太多的眷恋，太多的眷恋只会让人更加执着，形成沉重的包袱丢不下。不要画地自限，适时地跳出束缚，才能随心所欲。凡事随缘，无须强求。 ",
        detail4: "【典故】安禄山是唐玄宗时人，骁勇善战，被升为都督。当时朝政腐败无能，安禄山就是从山西省造反，攻打洛阳，再攻下潼关，皇帝逃走到四川。安禄山在长安大肆烧杀抢掠，人民激烈反抗。最后安禄山被自己的儿子杀死。 "
    }, {
        id: "第五十七签",
        lv: "中签",
        title: "董仲寻亲",
        content1: "说是说非风过耳 ，好衣好禄自然丰 ",
        content2: "君莫记取当年事 ，汝意还如我意同 ",
        detail1: "【卦意】此卦孩儿见母亲之象，凡事贵人大吉也。 ",
        detail2: "【解签】是与非就把它当成耳边过风，目前哪里有什么好顾虑的呢;你别忘记以往种种发生的事情，我们的想法依旧没有差异。选用谋望，皆大吉昌，从心恳切，如子见娘。此签好子见娘之象，凡事遇贵则吉。本签者好子见娘之象。凡事能遇贵人则化吉也。凡遇事可受贵人扶之。提携之后可成。必为其人所敬仰。一倡百和者。事事可以成功。好衣好禄日当空。易言之。选用谋望皆大吉昌。从心恳切。如子见娘。",
        detail3: "【解释】此签有”随机应变”之意。鼓励当事人，积极表现。有些人很懂得如何随机应变，有时连身边看似不起眼的物事，都可以适时拿来运用，成功地为自己加分不少。须知很多机会往往稍纵即逝，要能够把握契机。即使看似希望渺茫，但仍值得一试，说不定就此一举成功。在自己本身方面，凡事勿预设太多立场，不要太悲观，所谓”因地制宜”，配合环境、人事，适度地调整做人处世的态度。应勇于尝试，不要太固执而一成不变。",
        detail4: "【典故】神话故事，传说董仲是汉朝董永的儿子，是天上仙女下凡来和董永结合而生下来的。他学得仙法，会飞天，因此到天上去寻找母亲。又传说董仲因感于没有母亲，于七月七日这一天，到太白山上去找，仙女出现，董仲终于见到母亲。杜光庭：异录记。"
    }, {
        id: "第五十八签",
        lv: "中签",
        title: "文王问卜",
        content1: "直言说话君须记 ，莫在他乡求别艺 ",
        content2: "切须守己旧生涯 ，除是其余都不利 ",
        detail1: "【卦意】此卦守常待时之象，凡事守旧则吉也。 ",
        detail2: "【解签】忠言必逆耳的道理你必须牢记，何必舍近求远往别处寻找其它的技艺;劝你守旧温故而知新，除此之外应该是没有更好的方法了吧。得往且往，可往旧路，温故知新，莫求别路。此签守旧生涯之象，凡事不可妄为。本签者。要君尔必守旧生涯之象。凡事必须三思而后行。不宜轻举妄动。诗曰。忠言善语君须记。勿因不满现况而见异思迁。一股干劲。结果带来不可收拾之残局。是时悟之。不如不作。实时已晚。噬脐不及者。易言之。得往且往可往旧路温故知新莫求别路。",
        detail3: "【解释】此签有”虚心求教”之意。告诫当事人，勿恃才傲物。有些人因为本身才气纵横而自视甚高，因此目空一切，对于身边的人事物，也常看不上眼，甚至语多讥讽、一派自以为是，非不得已，决不向他人求教。须知过于刚硬的个性会带给别人不悦的感受而容易导致处处碰壁，倘若能够正视并收敛此种狂放自傲的个性，凡事虚心下问，加上本身的才华与能力，相信成就一定不只于此。对于身边亲朋好友的劝告，务必听进心里去，想一想别人为什么这么说。 ",
        detail4: "【典故】周文王建造灵台，以占风侯，看验民灾。当晚他太疲倦了，睡在灵台上，时至三更半夜，梦见一双白额猛虎，肋生二双翅膀，飞入帐中，文王惊醒，第二天问卜吉凶，卜后来文王在渭水得遇姜太公。封神演义。 "
    }, {
        id: "第五十九签",
        lv: "中签",
        title: "张良隐山",
        content1: "直上重楼去藏身 ，四围荆棘绕为林",
        content2: "天高君命长和短 ，得一番成失二人 ",
        detail1: "【卦意】此卦守旧随时之象，凡事待时则吉也。 ",
        detail2: "【解签】想上高楼躲避灾难，四周却处处是荆棘阻碍;须知万物的安排是早已经注定好的，世事难料，谁能知此刻的得意下一秒即变成失意。如醉饮酒，如何且守，直待时来，无灾无咎。此签守常待时之象，凡事只宜守旧。",
        detail3: "【解释】此签有”是非难断”之意。告诫当事人，喜恶勿过于分明。我们有时会对某些人觉得反感，不管对方说什么做什么，就是看不顺眼，十分排斥。甚至双方互不相让，情势也越陷越僵。其实同样的人、事、物，在你看来或许不好，但若换在其它人眼中，却变成是好的。须知”好”与”坏”很难论定，甚至没有一定的准则。但人都是用自己心里的一套标准来评断，而每个人又有不同的想法，所以看出来的事情就有了好、坏、对、错的分别。倘若能少点主观、多点客观，好恶心就不会那么重，也比较不会太固执。另外，凡事不要替人强出头，做好自己的本份，修身养性。 ",
        detail4: "【典故】汉朝时候，张良辅助刘邦取天下，打败西楚霸王项羽，建立了汉朝。张良知道刘邦此人，打仗时，称兄道弟，十分友善，可是得了天下就要杀功臣，变成了暴戾的皇帝。为了保全性命，他立刻隐退，不知所踪，据说跟亦松子（仙人）游山玩水去了。"
    }, {
        id: "第六十签",
        lv: "下签",
        title: "赤壁鏖兵",
        content1: "抱薪救火大皆燃 ，烧遍三千亦复然",
        content2: "若问荣华并出入， 不如收拾枉劳心 ",
        detail1: "【卦意】此卦抱薪救火之象，凡事亦自谨防也。 ",
        detail2: "【解签】宛如抱着木柴去灭火，火却越烧越旺，最后都被大火吞噬殆尽一无所有;此刻若要问出入营谋等事，还是安心守旧才能无忧。总有千般，一旦皆休，安心守旧，维得无忧。此签抱薪救火之象，凡事守旧则吉。本签示之于弟子曰。抱薪救火。当然火会增烟。霉头加以霉繇此可知。君尔凡是着手兴事。必须守旧。千万不能逞一时之勇。见人之成。见异思迁。轻举妄动。恐怕有大害。不仅不能成事。反而将事弄砸。得不偿失。易言之。总有千般一旦皆休安心守旧维得无忧。",
        detail3: "【解释】此签有”心浮气躁”之意。奉劝当事人，尽量平心静气。须知过度的情绪反应，会让人失去对事物应有的基本分析能力。也因为无法保持冷静，在此时做出的判断往往失策而且导致不可收拾的局面。如遇有大喜大悲大怒之事，不要急着做出反应，先试着把自己冷静下来，让情绪归于平稳。心平气和之后才能专心思考，谨慎反复过滤求证之后，才能做出正确理智的判断。凡事勿冲动躁进，小心行事，免得乐极生悲，后悔莫及。 ",
        detail4: "【典故】操大军驻扎在赤壁江岸旁，兵士多为北方人，不谙水性。周瑜要破曹操大军，苦无良策，幸得孔明祭东风，黄盖引火在三江口火攻曹操连环铁船，二方军队在赤壁下激烈水战，一片火海，曹军死伤不计其数。曹操带了一只败兵往陆地逃亡，走向鸟林。三国故事。 "
    }, {
        id: "第六十一签",
        lv: "中签",
        title: "苏小妹难夫",
        content1: "日落吟诗月下歌 ，逢场作戏笑呵呵",
        content2: "相逢会遇难藏避 ，唱彩齐唱连理罗",
        detail1: "【卦意】此卦守旧随时之象，凡事待时吉利也。 ",
        detail2: "【解签】与佳人白天吟诗晚上唱歌，欢喜作乐笑开怀;在此相逢聚首无所不谈，耳边众人的喝采声连贯不绝，这样的生活是很满足快乐的啊。佳人在屋，唱吟诗曲，一片欢嘉，取乐且足。此签佳人欢乐之象，凡事大吉如意。本签之示于弟子曰。日上吟诗月下歌者。为佳人欢乐之象者。凡是百事兴。大吉昌之征。因时运知。所谋之事也。百事如意之时。惟将如此康泰上盈之道。何如保之。冤之。保之。方能克终。易言之。君之今也。佳人在屋唱。吟诗曲一片欢嘉取乐且足之佳境。",
        detail3: "【解释】此签有”不可貌相”之意。鼓励当事人，要有自信。很多人常不甘安于现状，觉得自己地位太低、人微言轻，因此无不想力争上游，爬得越高越好。但俗云：”三百六十行，行行出状元”。职位高低代表的只不过是一时的虚名，不一定非要苦苦追求。这个社会需要各式各样的人，人人各司其职，才能保持平衡。应以自己的工作为荣，知福、惜福，安居乐业。切勿好高骛远，岂不知欲望少一点，快乐就更多一点？另外，切勿轻视小看地位卑微的人，也许其中卧虎藏龙个个身怀绝技，只不过自己有眼不识泰山罢了！ ",
        detail4: "【典故】传说苏小妹是宋朝大文学家苏东坡的妹妹，博学多才，民间故事流传很多，她和诗人秦少游结婚之夜，故意以诗歌、对联来刁难新郎，幸得苏东坡从中暗助，少游才得过关。古今奇观。 "
    }, {
        id: "第六十二签",
        lv: "中签",
        title: "唐僧得道",
        content1: "晨昏传籁佛扶持，须是逢危却不危",
        content2: "若得贵人相引处， 那时财帛亦相随 ",
        detail1: "【卦意】此卦神佛暗佑之象，凡事忍耐大吉也。",
        detail2: "【解签】早晚皆依靠神佛的护持与庇佑，纵然逢凶仍可化吉;倘若遇到贵人拉提牵引，这时候福禄自然也随之而来。诸事平稳，四方名显，改换从新，凶藏吉现。此签守旧平安之象，凡事遇贵则吉。本签也。守旧平安之象。凡兴事。能遇贵人扶持之时。必能顺利者。晨昏全赖佛祖扶持。因之。必须先由吾身之修德。积善始。神方能有所庇佑。凡事须隐忍。藏器以待用。不宜急。不可躁。易言之。君之命也。诸事平稳四方名显。改换从新。凶存吉现也。",
        detail3: "【解释】此签有”人善被欺”之意。意味当事人，勿灰心丧志。莫听他人闲言是非，有时面对别人的调侃相欺，不妨忍一时，无须放在心上。此刻莫要急躁，专注在修养品德之上，保持良好的处世态度，继续努力、并不间断地充实自我本身的学识。俗谚云：”不经一番寒彻骨，焉得梅花扑鼻香？”相信自己、存善持之以恒，必有大成之日。另外，对于亲朋好友的关怀协助，应要谨记在心，有机会便加以报答。 ",
        detail4: "【典故】唐三藏，俗姓陈，名祎。出生于洛州缑氏县（今河南省偃师市南境）。十三岁出家，法号玄奘。 为了求取佛经原典，于贞观三年（公元629年）从长安（今陕西西安）出发，冒险越过国境，历尽万苦千辛到达天竺(印度)取经。他遍游恒河与印度河流域以及印度东南沿海地区，然后翻越雪山和葱岭，往返跋涉五万余里，花了16年的时间，终于在贞观十九年（公元645 年）回到长安。携回大量佛经，并译成中文。 "
    }, {
        id: "第六十三签",
        lv: "下签",
        title: "女娲氏炼石",
        content1: "昔然行船失了针 ，今朝依旧海中寻 ",
        content2: "若然寻得原针在 ，也费工夫也费心",
        detail1: "【卦意】此卦海中寻针之象，凡事费心劳力也。",
        detail2: "【解签】从前驾船时遗落了针，现今仍然在海中寻找;倘若还能找到原来遗失物的地点所在，一定是费尽了心力与精神啊。福是福基，福埋福种，说得分明，且宜手拱。此签海中寻针之象，凡事费劳空力。本签也。海底捞针之象。凡事费劳空力之征。成为如此者。时也命也。不得违之。逞一时之强。却不得任何结果。反而受到不利。甚至吃亏。蚀本之情形出现。福是福基福埋福种。说得分明且宜手拱。",
        detail3: "【解释】此签有”刻苦磨练”之意。奉劝当事人，勿轻言退缩。须知在下任何决定之前，一定要经过审慎而思密的考虑。尤其当一切都是未知数时，原本就备加困难，本身是否合适、能否发挥，都是必须再三向自我求证的考虑因素。下定决心去做之后，就不要因为过程中必然遭遇的阻碍或不顺遂而心灰意冷，甚至想干脆走回头路。凡事不要轻言放弃，免得最后落得两头皆空，不仅劳心费力，更蹉跎了岁月，实在得不偿失。 ",
        detail4: "【典故】女娲氏是传说中的人物。传说，上古时代，共工氏和祝融氏是天上的二个巨人，有一天，二人打起架来，惊天动地，造成了很大的破坏，连天也被打破个洞，不停的流下水来。女娲氏是位女神，她在山上拣了许多五色石，用火烧成石浆，把天上的窟窿给补好了。女娲氏拣石补天。上古传说故事。"
    }, {
        id: "第六十四签",
        lv: "下签",
        title: "马前覆水",
        content1: "游鱼却在碧波池， 撞遭罗网四边围 ",
        content2: " 思量无计番身出 ，事到头来惹事非 ",
        detail1: "【卦意】此卦鱼遭罗网之象，凡事亦宜提防也。",
        detail2: "【解签】就似金鱼放入湖中本可自在悠游，哪里知道已被人在四处撒下了罗网捕捉;费尽了心力却无脱身之法，最终独自哀痛地命丧黄泉。身居尘内，祸自天来，早须防备，免受其灾。此签鱼遭罗网之象，凡事提防陷害。本签者。暗遭罗网四边围之命者。凡事必须提防歹人陷害。此运者起跌不常者。且虚。险。惊。改。凶之者多。经多方面涉尘。终能出险。惟此历程艰苦异常。无以数计。思量无计翻身出。易言之。身居尘内祸自天来。早须防备免受其灾。",
        detail3: "【解释】此签有”祸从口出”之意。奉劝当事人，勿心直口快。本身的自我情绪管理很重要，切忌在发怒或不顺意时就口出恶言。须知人在心情不稳定时脱口而出的话杀伤力都很重，在当下极容易触怒或伤害到他人，让人怀恨在心而不自知。这种言语上的过失，恐怕事过境迁也难以弥补。另外平常行事勿过于招摇，在物欲上应知有所节制，避免处处与人逞强比较。凡事谨慎谦虚待人，方可远灾避祸。",
        detail4: "【典故】汉朱买臣年轻时贫苦，他的妻子嫌他穷而抛弃他，别嫁他人。买臣发愤读书，求取功名，经年后买臣官至会稽太守，其妻要求再和，买臣骑在马上把水倒在地下，叫妻子再收回来，代表不可能的事。《烂柯山》传奇故事。凡入圣，得正佛道了。《西游记九十八回》 "
    }, {
        id: "第六十五签",
        lv: "下签",
        title: "孙膑困庞涓",
        content1: "眼前欢喜未为欢， 亦不危时亦不安",
        content2: "割肉补疮为甚事， 不如守旧待时光",
        detail1: "【卦意】此卦割肉成疮之象，凡事只宜守旧待时。 ",
        detail2: "【解签】眼前的欢喜不见得是真欢喜，祸福安危实在难以论定;到底为了什么事情要让自己受创？还不如安份守己才是上策啊。得止且止，知欢且欢，割自己肉，痛本一般。此签割肉成疮之象，凡事守旧待时。本签者。割肉成疮之象者。凡事必须守旧待时。不宜轻举妄动也。因时命之注定君尔之命眼欢喜未为欢。危不危兮安不安。日下运多拂逆。毫无利息可言。如百花凋落。无复荣华之望。几希万事皆空之势。易言之。如得止。且止知欢割自己肉痛本一般。",
        detail3: "【解释】此签有”自作主张”之意。奉劝当事人，不要太固执。人很主观，有时心里已经有主意的事，虽然可能还是会找大家商议，但纵使多半的人持反对或劝阻之意，却依然我行我素、执意照自己的意思去做，结果往往不如预期，甚至导致一败涂地。须知很多时候我们对事情的看法不见得都能面面俱到，多少会有遗漏或误判之处。因此对于旁人的善意提醒或规劝，应有雅量去接受，虚心检讨并加以改正。所谓”人非圣贤，熟能无过？”就算已经犯下了过失，但只要勇于认错，相信大家仍然会接纳、帮助你，让事情不致于到无法收拾的地步。 ",
        detail4: "【典故】孙膑为了要报被庞涓削了双足之仇，到了齐国，领兵攻打魏国的庞涓。双方交战后，孙膑佯作败退，引诱庞涓进入幽谷，当晚庞涓进入幽谷，道路狭窄，两旁多阻隘，庞涓被困其中，到了马陵，孙膑军队夹道埋伏，并且万箭齐发，大败魏军，庞涓无路可逃，自知大势已去，就在大树下自杀身亡。东周列国志。 "
    }, {
        id: "第六十六签",
        lv: "下签",
        title: "霸王被困",
        content1: "路险马嬴人行急，失群军卒困相当 ",
        content2: "滩高风浪船棹破，日暮花残天降霜 ",
        detail1: "【卦意】此卦船破下滩之象，凡事险阻提防也。",
        detail2: "【解签】催马行走，但地势险恶，距离仍相当遥远，失群的羊儿偏偏碰上了老虎;就似船只在急流狂风中行驶，也好比晚春将结束绽放的花朵，又遇霜雪更加速枯萎。守静安静，安分无忧，不须贪望，自有优游。此签意滞之象，凡事待时仔细小心。本签者意滞之象。凡举事待时。且必须仔细小心。无一是处之时。目下不许君丝毫动之。一动不如一静。以目前之情况守之。不可勉强。一强求。逞一时之勇之时亏即主。弄巧成拙。无一可图利。易言之。守静安静安分无忧不须贪望自有优游。",
        detail3: "【解释】此签有”六神无主”之意。奉劝当事人，勿心慌着急。人在遇到难题的时候，常会因不知如何是好，所以往往转而向旁人求助，希望藉由对方的建议，能让事情有所帮助。其实自己本身的问题，应该是自己最了解。不妨冷静下来，仔细思考，将事情层层抽丝剥茧、一一厘清之后，也许就能找出症结所在。若实在是想不出办法、非要向他人求助时，也不要随便拉个人就猛吐苦水，应慎选欲请教的对象。有些人可能听完还没消化，就主观的高谈阔论，不但对事情没有帮助，恐还因此被他人的你一言、我一语误导了方向，更加混乱。应请教客观中肯、又能从中指出关键处的对象，才有助于厘清问题，帮忙你解决困难。 ",
        detail4: "【典故】楚霸王（项羽）有一支强大的军队，战无不胜，刘邦的军队也很强大，但不及项羽，项羽多次征战胜利后，就自以为天下无敌了。后来和刘邦开战，项羽被刘邦军队包围在垓下，四面楚歌，军心大动摇。项羽被困在帐中，心情恶劣，饮酒解愁。在绝望中，项羽冲杀出重围，逃到乌江旁，因感到无颜见江东父老，拔剑自杀。史记。 "
    }, {
        id: "第六十七签",
        lv: "上签",
        title: "金星试窦儿",
        content1: "一条金线秤君心 ，无减无增无重轻",
        content2: "为人平生心正直 ，文章全贝艺光明 ",
        detail1: "此卦心平正直之象，凡事安稳无凶也。 ",
        detail2: "【解签】想要用一条金秤来衡量你的品性节操，是测不出增、减、轻、重的;乃是因为你平生存心端正毫无偏私，纵使不识文字，仍然通晓义理无碍。平生正直，善处人情，只依本分，天下太平。此签心中端正之象，凡事平稳大吉。本签之曰。心中端正之象。凡事能平稳大吉之者。一条金銔等君情。由它衡量即是无减无增。无重轻为人之道。即是人心平生心正直之时。即使不识文章也明白义之道理。易言之。平生正直善处人情只依本分天下则太平矣。清高门路即可。",
        detail3: "【解释】此签有”乐善好施”之意。提醒当事人，适度地投其所好。一个人本身倘若存心正直、知礼守法，已属难能可贵。但除了本身的品德之外，如何兼顾人情，也是必须注意的因素。在与人相处时，倘若能够多花一点时间，用心倾听对方的感受，不但能让对方觉得有”被重视”的感觉，更可因此知道对方的喜恶，帮得上忙的地方就尽力协助，而对方的禁忌，也可以避免误触。这种处世哲学，跟佛经上所说的”悉令满足诸需求”有异曲同工之妙。人都是互相的，当你替对方解决了问题、让对方心无烦忧之后，对方也会反过来想帮助你。这时再提出自己的看法与做为，相信一定能获得多数人的支持与认同，让事情更圆满。所谓”带人要带心”，也是这个道理。 ",
        detail4: "【典故】窦燕山因行善积德，后生五子，一门显贵。五子名为‘窦伦、窦信、窦仁、窦仪、窦偃。一日窦仪投宿某客栈，上天要试窦仪的心，于是派遣金精化为女子，诈称临家少女，夜扣窦仪房门，窦仪闭户不纳，此女以投水自尽相要挟，窦仪终不为所动，开门拔剑追女，女子化做一道金光进入地下，窦仪掘地底金一锭。应为‘金精试窦儿’以度探窦仪之诚。今河北省涿县窦店就是窦家故籍。《善尘缘》传奇故事。"
    }, {
        id: "第六十八签",
        lv: "上签",
        title: "郭汾阳祝寿",
        content1: "门廷吉庆喜十分， 积善之门大吉昌 ",
        content2: " 婚姻田蚕诸事遂 ，病逢妙药即安康 ",
        detail1: "【卦意】此卦春梦百花之象，凡事贵人大吉也。 ",
        detail2: "【解签】家风清廉，梦也吉祥，积善人家，必有余庆;讼有理，婚可成，衣无缺，纵有疾病，得遇良药，可保安康。日暖风和，百花大发，事莫疑迟，从今显达。此签日暖风和之象，凡事大吉大利。本签者。日暖风和之象。凡事大吉大利者。君尔之门庭清吉。梦也祯祥。古人劝之。积善之家庆有余。家运大吉大利也。积善者。先由心正。不存邪。助人为乐。修身。布施之谓。因之。讼理婚成蚕又熟。易言之。日暖风和百花大发事莫疑迟从今显达。",
        detail3: "【解释】此签有”世代传承”之意。提醒当事人，保持良好的典范。一个人的思想行为，很容易在不自觉中受到别人的影响。因此为人父母师长者，在教导晚辈子女时，应以身作则，举手投足间，都会是对方模仿学习的对象，意义重大、影响深远。在自我本身方面，维持良好的品性道德，勿以恶小而为之，勿以善小而不为。学习他人的长处，若见别人的缺失，也要警惕自己勿犯相同之过。本身有益的经验，不妨试着传承下去，让青山常在、绿水长流。 ",
        detail4: "【典故】郭汾阳即郭子仪，因受封汾阳王，故称郭汾阳，其第六个儿子，和皇帝的女儿结婚，夫妻并不和谐。一年，郭子仪做大寿，亲戚朋友都来拜寿，独其媳妇不肯拜，因为她是皇帝的女儿。为了此事，夫妻争吵一番，媳妇投高皇帝，子仪于是见皇帝要求赦罪，但是皇帝宽宏大量，认为是家庭琐事，不予计较。"
    }, {
        id: "第六十九签",
        lv: "中签",
        title: "梅开二度",
        content1: "冬来岭上一枝梅 ，叶落枝枯终不摧 ",
        content2: "但得阳春悄急至 ，依然还我作花魁 ",
        detail1: "【卦意】此卦梅花占魁之象，凡事宜迟则吉也。 ",
        detail2: "【解签】就似严冬高山顶上的一株梅花，受尽风霜雨雪的侵袭依然挺立不摇;得悉春天的日子就快要来临了，届时仍是花中之王，谁能比拟？一箭落空，非空不空，看非景致，消息在中。此签梅花占魁之象，凡事宜早吉利。本签者梅花占魁之象。凡事宜平吉利者也。冬至。岭上之一枝梅也。虽是叶落枯根。伊亦能傲霜斗雪疏影横斜。放出幽香。为世人报得春之跫音将至。君多年之傲苦也。必得一报。出头天者。易言之。君之运也。一箭落空非空不空看非景致消息在中者。",
        detail3: "【解释】此签有”沉冤得雪”之意。意味当事人，不要太悲观。人在时不我予时心态本就消极，倘若还为他人所误解，更如哑巴吃黄莲，苦不堪言。在此看看程婴匿孤存赵的故事，他不但忍辱负重十数年，甚至默默承受不义之丑名，只为了不让忠臣绝后。如此精神情操，今世几人有之？反观自己，不过一时的不顺遂，何苦因此自怨自艾，只要存心正直，凡事无愧于天地，相信必有时来运转、还你清白之日。 ",
        detail4: "【典故】唐朝时代，梅魁被奸臣宰相害死，儿子梅良玉被救，改名王喜童，进住陈日升的家。梅魁是日升好友，一天，梅花盛开，陈公借梅花拜祭梅公，祈求有日梅公后代能出人头地，为父报仇。当晚梅花皆被风雨打落，陈公和女二杏元、良玉于是拜求上天再一次梅花盛开，诚心感动了上天，第三天果然见到满园梅花盛开，香气袭人，梅开二度，成为千古佳话，后来，梅良玉考中状元，几经挫折，终和陈杏元结婚。《二度梅》故事 "
    }, {
        id: "第七十签",
        lv: "下签",
        title: "李密反唐",
        content1: "朝朝恰似采花蜂， 飞出西南又走东 ",
        content2: "春尽花残无觅处 ，此心不变旧行踪 ",
        detail1: "【卦意】此卦蜜蜂采花之象，凡事劳心费力也。 ",
        detail2: "【解签】犹如成日劳苦奔波的蜂儿，自东向西，又自西向东地飞来飞去;但是春残花谢，哪里还找得到蜜可采呢？就不必再一心眷恋旧花丛了吧！役役终朝，暗雨不清，用尽机谋，争加寂寞。此签游蜂采花之象，凡事劳而无功。本签者游蜂采花之象。凡事劳而无功者。飞来飞去而复东。春届暮节花残也无其觅处。栖身之所。交易。婚姻。求财。六畜。生产。皆无一是处。在此苦境之时。最宜修吾身。积吾善。行布施。善吾之言行。方能有转机。易言之。役役终朝暗雨不清用尽机谋争加寂寞者。",
        detail3: "【解释】此签有”事与愿违”之意。奉劝当事人，勿一厢情愿。在与人沟通时，切忌心直口快、口不择言。与其直接，不如在说话之前，思量再三，婉转有礼的表达其意。倘若一开口就让对方觉得不舒服，事情岂不是已经失败了一半，要再补救，可能备加困难。须知本身热心是善，但在听取他人言论之时，不应全部信以为真，宜用智慧来判断真假、才能明辨是非。不要自作聪明，认为”事情就是如此”，否则恐遭他人利用，奔波劳碌，还得罪了不相干的人，结果却是白忙一场。凡事勿先入为主，免得乐极生悲。 ",
        detail4: "【典故】李密是隋朝末年，反抗隋炀帝的瓦岗军首领，自称魏王，大将有秦琼、单雄信、程咬金等英雄好汉。后众叛亲离，自己和王伯当投靠唐王李渊，并娶了李仁公的公主为妻，安享荣华富贵，但他仍不满足，杀了妻子而反唐，和王伯当一起被乱箭射死，死时三十七岁。"
    }, {
        id: "第七十一签",
        lv: "中签",
        title: "文君访相如",
        content1: "认知仓龙十九卫 ，女子当年嫁二夫",
        content2: " 自是一弓架两箭， 切恐龙马上安居",
        detail1: "【卦意】此卦一弓架两箭之象，凡事再合则吉也",
        detail2: "【解签】谁能知道爱妾会碰上强权，让小女子在那时嫁了两个丈夫;这乃是犹如一支弓搭上了两支箭，又好比驾龙驭虎，左右逢源。不审不审，事由天命，辰午中间，切须谨慎。此签一弓两箭之象，凡事改变大吉。本签之示意者。一弓两箭之象。凡事改变则大吉者。骑龙跨马上安居。凡事切莫堕志。修心向善去。自有好处。目下虽略困。但是。终必逢时。但勤劳。人事己尽天理。无不准。易言之。不审不审事由天命辰午中间切须谨慎",
        detail3: "【解释】此签有”众志成城”之意。提醒当事人，团结力量大。人往往为了理想努力去实现，但同时也要兼顾现实面、而不得不蜡烛两头烧，既无人能了解，还可能被误解。在此情境之下，心里会觉得十分疲惫。须知有远大的理想与目标并愿意去实行是很了不起的一件事。既然想去做了，抱定的这股坚持与冲劲，当然要持续下去。但所谓”三个臭皮匠，胜过一个诸葛亮”。有时与其自己单打独斗，还不如集思广益、汇聚众人的力量，来共同完成一件事。这个人倘若做不到的地方，那个人也能立即过来补足。大家有志一同、齐心协力，相信必能让事情推动得更加顺利。 ",
        detail4: "【典故】古代恋爱故事，汉朝时，卓文君的丈夫死后，在家守寡，读诗书过日子，一日邂逅了很有学问的司马相如，卓文君深夜造访相如，倾诉心中慕情，二人遂私奔出城，回到成都结为夫妇。后来司马相如被汉武帝赏识，在朝庭当官。苍龙：青龙。九衢：繁华的街市。史记 "
    }, {
        id: "第七十二签",
        lv: "中签",
        title: "王莽求贤",
        content1: "养蜂须用求他蜜 ，只怕遭触尾上针",
        content2: "须是眼前有异路 ，暗惊深如荆棘林",
        detail1: "【卦意】此卦雷发百虫之象，凡事遇贵人吉兆也。 ",
        detail2: "【解签】取蜂的原因是为了得到蜜汁，但还是担忧会遭其尾刺所伤;即使表面上看去仍有不同的途径或方法，谁知暗地里却仍然布满了荆棘。事须仔细，不可强求，如蜂采蜜，着其由来。本签示之于弟子曰。事须仔细不可强求如蜂采蜜着其由来。事后遂意。皆祖宗积德之所致。若能顺理而行。益加倍植。则天之报施。凡事先苦后甘之象。必须忍耐。否则无由成功。由忍一字。将有转凶化吉之时。",
        detail3: "【解释】此签有”寄人篱下”之意。意味当事人，凡事忍耐则吉。我们常常有”人在屋檐下”之叹，总觉得抱负无法伸张、或不得不为某些情况折腰。但所谓”山不转路转，路不转人转”，其实很多时候只要换个角度、逆向思考，心境就能改变。在现实环境受限、不允许大幅度改变时，不妨忍一时，勿在此刻做下任何草率冲动的决定。保持乐观轻松的心情，而不是轻易地被环境或人事所影响。坚守岗位、做好份内之事，相信必有时来运转之日。 ",
        detail4: "【典故】西汉时的王莽家族，可以说是豪门世家。他父亲虽然早死，但他的几个伯父、叔父在汉成帝时，一个个出将入相、封侯受赏，王氏一门可谓显赫至极。后来，他的叔父、大司马王根病逝，临终举他以代。皇帝及众大臣都认为他最适当不过。于是，才仅仅三十八岁的王莽，便做了掌握全国最高军权的大司马。。 "
    }, {
        id: "第七十三签",
        lv: "上签",
        title: "陈桥兵变",
        content1: "春来雷震百虫鸣 ，番身一转离泥中",
        content2: "始知出入还来往， 一朝变化便成龙 ",
        detail1: "【卦意】此卦似鹄投水之象，凡事多虚少实也。 ",
        detail2: "【解签】春雷震醒了冬眠中的虫儿，离开了旧有的蛹茧卸去了束缚;待遇到风云交会之际，自然就能变化成龙了。震开蛰月，思入风云，一好变态，直入天宫。此签蛰中变态之象，凡事变化则吉。本签示之于弟子曰。是蛰中变态之象也。凡事变化则吉者。事事求变。舍旧图新。求合时潮。何必烦恼。一定可转机。多费心机。可有转变。君尔可知。功名富贵迟速有时。待时而动则吉也。易言之。震开蛰月思入风云一好变态直入天宫。",
        detail3: "【解释】此签有”伯乐相马”之意。提醒当事人，要沈得住气。韩愈《马说》内言道：”世有伯乐，然后有千里马。千里马常有，而伯乐不常有。”千里马可遇而不可求，如何”遇”?在上位者，应有过人之见，细心深入地观察周遭的人，多花点时间倾听基层的声音。不以外表、学历等外在考虑来评断限制一个人，用人唯才。也许千里马就在身边，却被自己忽略了呢。在基层者，也不要因为没遇到”伯乐”而丧志，仍应保持良好的工作能力与态度。只要自己不先放弃自己，相信一定能遇到赏识重用的人，让你大展所长。 ",
        detail4: "【典故】周世宗死后，由他七岁的儿子继位，他的母亲符太后掌管政权。赵匡胤为当时长官，许多亲信和兄弟都想造反夺权。这年年初三，匡胤等人率领军队到陈桥驿宿营，当晚一部分将官发动兵变，声言拥赵匡胤为皇帝，并把一件黄袍加在他身上，山呼万岁。黄袍加身后，立即回开封，自己做了皇帝，改国号为宋，是位宋太祖。宋朝在历史上有三百二十年天下。 "
    }, {
        id: "第七十四签",
        lv: "下签",
        title: "秦败擒三帅",
        content1: "似鹄飞来自入笼， 欲得番身却不通",
        content2: "南北东西都难出 ，此卦诚恐恨无穹 ",
        detail1: "【卦意】此卦抱虎过山之象，凡事险凶惊恐也。",
        detail2: "【解签】犹如懒飞不驯的鹤鸟自投罗网，原本意欲冲天，不料却深陷其中;天地虽大却四处都充满了阻碍，导致委靡不振，悔恨不已。进身不得，退步而行，命运乖蹇，切勿交争。此签野鹤投笼之象，凡事守旧留心。本签示之于弟子曰。野鹤投笼之象。既然是投笼者失去自由之意。当自守旧留心。今之命也。东西南北浑障碍者。此身憔悴。恨无穷之时。正逢不堪景象。凡事守之。慎之。三思而后行方可。易言之。进身不得退步而行命运乖蹇切勿交争。",
        detail3: "【解释】此签有”难容二虎”之意。奉劝当事人，思虑要周详。人有自信、有才干是一件好事，但过度的锋芒与自信，只会让自己更成为别人眼中的标靶，欲除之而后快。若欲转换新环境，也不要急着表现或夸耀自己的能力，须知”同行相忌”，尤其是与他人有直接利害关系时，倘若本身能力明显胜过对方，更易招人眼红，甚至被人在暗地里落井下石，蒙受不白之冤。宁可小心内敛，处处谦让;保持柔软的身段，凡事低调谨慎。更要慎选合作对象，免得水火不容，陷入进退两难之境。 ",
        detail4: "【典故】秦穆公不听老臣蹇公劝告，派军队攻打郑国，和晋国人在殽（位于中国河南省洛宁县与陕县之间）大战。晋国军队把秦国军队诱入危险山谷中，前路被堵塞，两旁晋兵抛火种硫磺硝石，后面晋兵杀声震天，秦军自相践踏，死伤无数。不敌而至大败，三个大元帅，俱皆被擒。 "
    }, {
        id: "第七十五签",
        lv: "中签",
        title: "伍员夜出昭关",
        content1: "恰如拖虎过高山 ，战战竞竞胆碎寒",
        content2: "不觉忽然从好事 ，切须保守一身安",
        detail1: "【卦意】此卦抱虎过山之象，凡事险凶惊恐也。",
        detail2: "【解签】似抱虎过山，战战兢兢心碎胆寒；幸好在前方遇得高人相助，方可保得平安。危险危险，前程阻隔，切莫远行，自宜守节。此签抱虎过山之象，凡事先凶后吉。本签示之于弟子曰。宛如抱虎过山前之景也。令人战战兢兢胆碎寒者。凡事必须多擘画。千万不得轻举妄动。机密不密则不成。须防口之血半。惟君尔之修身。积德功夫一至。必能逢得妙手。方能保得一身平安。易言之。危险危险前程阻隔切莫远行自宜守节。先凶后吉者。",
        detail3: "【解释】此签有”未雨绸缪”之意。意味当事人，凡事都应先做好计划。所谓”养兵千日、用在一时”。只有平日做足了准备，才不会惊慌失措、临时抱佛脚。遇有紧急状况时，要保持冷静，千万不要轻举妄动、自乱阵脚。倘若本身参与了一件涉及机密的重要任务，则应守口如瓶，谨防一时大意而泄漏口风。另外，本身行为端正，心存善念以诚待人，如此相信纵使遇到再大的困难，也一定会有人愿意伸出援手，帮助你共同度过难关。 ",
        detail4: "【典故】伍员又名伍子胥，春秋时代楚国人，其父兄是朝廷重要官员，他们被楚平王杀死后，伍员和太子健的儿子胜，漏夜逃走。到了昭关，守关的官员要捕捉他们，伍员和胜分别独自步行出关，躲躲藏藏，提心吊胆，由于过度忧虑，一夜之间，伍员的头发全变白了，伍员和胜终于脱离险境，到达吴国。 "
    }, {
        id: "第七十六签",
        lv: "中签",
        title: "洪武看牛",
        content1: "鱼龙混杂意相同 ，耐守深潭待运通",
        content2: "不觉一朝头耸出 ，禹门一跳过龙宫 ",
        detail1: "【卦意】此卦鱼龙未变之象，凡事待时至可也。",
        detail2: "【解签】龙与鱼混在一起看来毫无差异，困守寒潭无济于事;待有朝一日大展头角之时，届时自然鱼跃成龙，一飞冲天。虽有址地，不如待时，营谋出入，切莫安为。此签禹门未透之象，凡事变化则吉。本签者。禹门未透之象。凡百事变化则吉之意。鱼与龙两者混杂潭中意和同。耐守于潭却未济中时。唯有一朝头角耸之刻。君尔即可由禹门一跃到天宫去者。贵人逢遇之曰。必有被擢拔之时。彼时商贾者财利勃发。家宅产业兴隆。另言之。虽有址地不如待时营谋出入切莫安为。",
        detail3: "【解释】此签有”常持善念”之意。提醒当事人，多多将心比心。社会上大部分的人，都是以自我为中心，很少能真正地顾及到旁人的感受。然而每个人不论贫富、地位高低，内心都想寻求一种快乐而不是痛苦的感觉。倘若我们能有这种仁慈的、将心比心的观念，那么当我们在看待别人的时候，自然而然会产生一个”同理心”，了解”己所不欲、勿施于人”的道理，再进而推己及人。凡事只问耕耘、不问收获，自己能够做得到的，一定自己先去做。",
        detail4: "【典故】朱洪武就是朱元璋，明朝第一任皇帝，他出身在贫苦农民家庭，幼年时替人放牛过日子后来又到皇觉寺当和尚，他参加了农民起义军，率领军队十万之众，打败了元朝，建立了明朝，是为明太祖。朱元璋小时看牛，很是顽皮，传说他每天放牛上山，就口里喃喃念道：“草儿快快长，快快长，牛猛吃，草猛长”。说完就去玩耍，那些草好似听他金口说话，越长越多，牛也长得又肥又壮。 "
    }, {
        id: "第七十七签",
        lv: "中签",
        title: "捧璧归赵",
        content1: "梦中说得是多财 ，声名云外终虚来",
        content2: "水远山遥难信实 ，贵人指点笑颜开 ",
        detail1: "【卦意】此卦梦中得宝之象，凡事虚多少实也。 ",
        detail2: "【解签】在梦里说梦见得到了大量的珠宝，犹如身外虚名不必再去推测;山高水远如何能凭断距离?待贵人一指明路，因才领悟而笑逐颜开。梦中说梦，声名虚望，只好待时，贵人接引。此签梦中得财之象，凡事空虚无力。本签示之于弟子曰。梦中得财之象。亦即是空虚无力者。总而言之。身外浮名。总无可猜。水远山遥难信定。伊是遥远之地。无法信之。定之。贵人一指时。君尔笑逐颜开。易言之。梦中说梦声名虚望只好待时贵人接引。",
        detail3: "【解释】此签有”笑里藏刀”之意。奉劝当事人，勿心怀不轨。言语是一门艺术，也是一项工具，可以用来杀人，也可以用来救人。有人可能天生伶牙俐齿，能够把话说得很圆，在当下就能让对方深信不疑。本身能言善道是一件好事，但在说话的同时，”心里想的”也很重要。倘若心存善念，那么说出口的话，相信也会是好话。反之，倘若只是表面上说的好听，但心里却充满怨恨，只想着如何报复别人，那“言语”就变成了一种恐怖的工具，可以杀人于无形之中。须知不怀好意，终将害人害己。",
        detail4: "【典故】春秋时代，赵国惠文王得到一块世上稀有的美玉，称为和氏壁，秦昭王知道了，要以十五座城池封换和氏壁，惠王知道秦王要骗他，但毫无办法对付。他委派蔺相如带了玉壁到秦国谈判，结果暴露了秦王的欺诈，相如收回玉壁，拒绝卖给秦国。当夜相如完好的将玉壁带回赵国，保住了价值连城的宝物。《东周列国志》 "
    }, {
        id: "第七十八签",
        lv: "上签",
        title: "临潼救驾",
        content1: "冷水未烧白沸汤， 不寒不热有温凉",
        content2: "要行天下无他事 ，为有身中百艺强",
        detail1: "【卦意】此卦平善用事之象，凡事平稳大吉也。 ",
        detail2: "【解签】犹如用冷水浇淋白雪，不冷也不热;欲走遍天下而无变故忧虑之法，唯有内含丰富且有余的本领罢了。囚徒得赦，病遇良医，求财谋望，贵人指迷。此签平稳用事之象，凡事大吉利也。本签即是平稳用事时。凡事大吉利者。亦即是冷水来浇时也。白雪洋。时令不寒不热时自有温凉者。逢此时令时。君尔行天下时。并无他事。唯君汝。必须藏有一艺之长久。可行天下无阻。易言之。囚徒得赦病遇良医求财谋望贵人指迷。",
        detail3: "【解释】此签有”人外有人”之意。提醒当事人，凡事谨言慎行。有时我们自以为什么都知道，尤其是对现状驾轻就熟的时候，很容易不自觉的自满或松懈下来，言行举止也在不知不觉中变得傲慢无礼。但所谓”一山还有一山高”，须知天下之大，比我们见多识广的人一定多如牛毛、密如过江之鲫。因此切忌自以为是、咄咄逼人，在自身状况良好的时候，也别忘了提醒自己：”强中仍有强中手”。勿过于松懈，仍应时刻充实自我，发现有不足的地方，就要想办法弥补。凡事谦冲忍让，莫逞一时口舌之争。 ",
        detail4: "【典故】隋朝末年，天下纷争，李渊起兵太原，自称唐王。某日，李渊一家大小，经过临潼山，日方正午，突然杀出一队埋伏的人马，要取李渊等性命，李渊顽抗，形势十分危险，这时秦琼（叔宝）在附近伍员庙中午睡，听到嘶杀声，赶来一看，见是李渊，即刻将敌人杀退，救了唐王。李渊后来为唐高祖，秦琼武艺高强，有万夫不当之勇。《说唐》故事 "
    }, {
        id: "第七十九签",
        lv: "中签",
        title: "暗扶倒铜旗",
        content1: "虚空结愿保平安 ，保得身安愿不还",
        content2: "莫忘神圣宜还了 ，此知神语莫轻慢 ",
        detail1: "【卦意】此卦信实莫信虚之象，凡事守旧之兆也。",
        detail2: "【解签】曾在虚空中许下了愿望，保全了人的平安，但是愿望还没有报答;目的达到了，别人的帮助却不记得，难道敢如此轻视当初的誓言吗?有人见我，空自怀然，佛慈指药，切莫轻瞒。此签信实不虚之象，凡事待时耐守则吉。本签示之于弟子曰。信实不虚凡事待时耐守则吉之灵签也。唯君尔虚空结愿结人缘。一人之力。有限者。倘若逞一时之勇盲目猛冲。恐有难发生之时。时也命也。汝可悟之。叵逞勇矣。易言之。有人见我空自怀然佛慈指药切莫轻瞒。",
        detail3: "【解释】此签有”一诺千金”之意。提醒当事人，信守承诺。老子说：”夫轻诺必寡信。”意思是说，一个凡事都轻言承诺的人，必然难以守信。因此，不要轻忽任何曾经许下的诺言，对象包括他人与自己。能够帮助别人是一件美德，但在答应别人之前，一定要先考虑：对方的要求，是否适当?合理?。而在自我本身方面，也需仔细考虑，倘若没有能力做到的事，就不要轻易地向别人许下承诺。但是一旦答应了别人的事，不论大小，都应当全力以赴、尽量做到。",
        detail4: "【典故】隋唐故事：东岭关杨义臣摆一座铜旗阵（以一支大旗杆为主）坚强无比，守将东方伯，有万夫莫当之勇，秦叔宝领兵来攻打，罗艺知道了，就命令公子罗成保护铜旗阵，罗成答应，但他母亲说他必须帮助表哥秦叔宝，不能助杨义臣，他必须明保铜旗，暗助西魏（叔宝），罗成果然在破阵日，打倒铜旗，杀了杨义臣等大将，投靠西魏。《说唐》故事 "
    }, {
        id: "第八十签",
        lv: "上签",
        title: "智远投军",
        content1: "直上仙岩要学仙 ，此知一旦帝王宣 ",
        content2: "青天日月常明照 ，心正声名四海传 ",
        detail1: "【卦意】此卦贵人接引之象，凡事和合大吉也。",
        detail2: "【解签】本欲上高山学习仙术，谁知一日忽被帝王宣召;本身端正无私就好似红日当空，心中的抱负想必也能一举皆知，名扬四海了啊。有始有终，大问西东，心中用事，贵人重重。此签贵人性情之象，凡事遇贵全吉。本签示之于弟子曰。贵人性情之象也。凡百事遇贵人即化凶趋吉者。由诗意得知君尔直上高山去学仙。岂知一旦帝王宣。即青天白日常明照。晴天无一片云。白日常照时。君之命运。正如当中。易言之。有始有终大问西东心中用事贵人重重。",
        detail3: "【解释】此签有”身先士卒”之意。鼓励当事人，凡事无私奉献。现在的社会，人与人的相处越来越冷漠。随着诈骗案件的层出不穷，大部份的人都只想求自保的心态下，很多情况，都不愿意再伸出援手。但是还有另一种人，只想着倘若对事情能有所帮助、就会尽量去做，不计较利益得失，当然更不会想到自己。这类的人以投入义工居多，堪称是人间的活菩萨。须知个人的力量虽然单薄，但只要愿意去做、把被动的想法化为主动而积极的行动，凡事身先士卒、不问一己之私、不在乎能不能得到回报，相信一定会为自己的内心带来难以言喻的真正快乐。",
        detail4: "【典故】刘智远（知远），沙陀族人，出身贫穷，在患难中和李三娘结为夫妇，住在李家庄，因不堪二舅的欺凌，出外从军，投于岳勋处为部将，终以战功，官九州安抚使。后又投靠石敬溏。公元九四七年在晋阳自立为皇帝。史称后汉高祖，只有二傅。《白兔记》故事 "
    }, {
        id: "第八十一签",
        lv: "上签",
        title: "风送滕王阁",
        content1: "梧桐叶落秋将暮 行客归程去似云",
        content2: "谢得天公高着力 顺风船载宝珍归 ",
        detail1: "【卦意】此卦梧桐落叶之象，凡事先凶后吉也。",
        detail2: "【解签】秋天即将结束，庭院前树上的叶子纷纷飘落了下来，出门在外的游子归心似箭;感谢上苍暗中轻轻使了助力，借着顺风让我和满载的行囊更加速返乡。心中所望，天必从之，所谋用事，尽可施为。此签从心所望之象，凡事大吉利。本签也。从心所望之象也。凡事大吉利者。一叶如秋后。逐渐有机缘。行客之来势如飞奔。风送君尔之船。只要轻轻着力。尔船即将宝藏船舶推送回来。不必费力者。此者非人力之所逮。易言之。心中所望天必从之所谋用事尽可施为。",
        detail3: "【解释】此签有”谋事在人”之意。意味当事人，凡事勿太悲观。人在面对艰难或遥不可及的任务时，第一个冒出的念头往往是”不可能”。其实”不可能”是一个消极且较没有自信的想法，当我们先入为主的就认定某件事”不可能”时，通常也等于间接否定了自己。然而世事本就难以预料，所以又怎么能肯定，有些事情是绝对不会发生的呢?与其一开始就觉得”不可能”、”做不到”，还不如保持积极乐观的态度，试着踏出第一步，先不要预设太多立场。接下来，也许会有意想不到的成果与收获呢! ",
        detail4: "【典故】唐朝咸淳二年，南昌县长阎伯屿重修腾王阁，定了九月九日设宴请客，并邀请天下名士出席宴会，目的要他女婿写一篇序文，以出风头，时王勃（唐初四杰之一）知道了，要去凑热闹，可是到南昌行程七百里，需时三天，此时已是九月初七日，赶不上了。是夜，王勃梦见水神对他说一句话：“送君一帆”，次日王勃扬帆过江，舟行飞快，风送七百里路程，王勃及时赶到南昌，在会上写了千古绝妙的《腾王阁序》。风送腾王阁，时来运到的意思。 "
    }, {
        id: "第八十二签",
        lv: "中签",
        title: "火烧葫芦谷",
        content1: "炎炎烈火焰连天， 焰里还生一朵莲 ",
        content2: "到底得成终不害 ，依然生叶长根枝 ",
        detail1: "【卦意】此卦火里生莲之象，凡事似险非险也。",
        detail2: "【解签】火势凶猛，烈焰冲天，但莲花不受影响，依然在其中滋长;直到最后也并没有被折损，仍然枝繁叶茂，色彩鲜艳。虽是危险，不伤其身，营谋用事，皆得贵人。此签火中生莲之象，凡事先难后易。本签者。火中生莲之象。凡事先难后易者。目下时运未济。千万不可逞英豪。图意外之财。却反而损失不赀。所幸到底永成根不坏。依然枝叶色新鲜。尔之命也。可因命大。遇险而不危。易言之。虽是危险不伤其身营谋用事皆得贵人。",
        detail3: "【解释】此签有”因人而异”之意。意味当事人，不要太过执着。当我们在做一件事或向别人表达某些观点时，会发现有人能理解、有人却不能。此时也许会懊恼：为什么同样一件事、说的是同样的话，反应结果却是两极?其实每个人都有每个人本身的个性、想法与特质，包括自己也是。硬要把自己的想法加诸在别人身上是行不通的，常常只会造成反效果。何不试着多花一点时间，去了解别人的观点与性质差异。知道对方的喜恶之后，才能进一步沟通，也可以避免误触对方的禁忌。做起事来，一定更加事半功倍。 ",
        detail4: "【典故】刘备和周瑜联合攻打曹操，孔明设七星台祭东风，助周瑜火烧赤壁，曹军被烧得狼狈而逃，曹操也带着一支残败军队逃亡。孔明派大将在各处埋伏捉拿曹操。他派张飞去葫芦谷，不久，曹操和兵士到了葫芦谷口，人马困顿，坐下来休息烧饭。曹操在马上大笑孔明智谋不足，突然张飞杀到，山谷四处起火，曹操军队挣扎一番，在火中狼狈而逃，走华荣道。三国故事 "
    }, {
        id: "第八十三签",
        lv: "中签",
        title: "李渊登位",
        content1: "譬若初三四五缺， 半无半有未圆全",
        content2: " 等待十五良宵夜 ，到处光明到处圆 ",
        detail1: "【卦意】此卦月缺未圆之象，凡事候时则吉也。",
        detail2: "【解签】就像初三、四、五的月亮，似有若无仍未达完满;待等到十五夜来临，四处各地即都可见清亮无比的满月。知足自足，如月初出，直到圆时，无有不吉。此签如月初出之象，凡事待时则吉。本签者。如月初出之象。凡事举之时。得待时。来济时方吉者。君尔之今则是时运未济之时。今之不逢时叵逞强。欲图意外之财时。反而将失利者。宜控制之。不宜放任行之。汝必须待到十五良宵夜。月光明才可见。到清光。易言之。知足自足如月初出直到圆时无有不吉。",
        detail3: "【解释】此签有”凡事适中”之意。意味当事人，量入为出。每个人多多少少会有个人的喜好跟兴趣，例如有人喜欢爬山、有人喜欢唱歌、或买东西、喝喝小酒...等。有嗜好跟消遣是一件很好的事，也不失为抒发压力的一种方法。但是倘若太超过而沉迷其中，也很危险。运动过度会导致体力无法负荷、开销过大会导致入不敷出、喝酒过量则会伤肝。因此，凡事都应适中，平常就要能有自我约束、自我节制的能力。应时刻检视本身的行为举止，如有不当之处或不好的恶习，要能深切自省、及时改过，才不会一错再错、因小失大。 ",
        detail4: "【典故】李渊是隋朝末年在太原起兵的将官，部下大将有秦琼（叔宝）、徐茂公、称咬金等，公元六一八年，隋炀帝在江都被部将杀死，李渊在长安登位做皇帝，国号‘唐’，是为唐高祖。唐朝在历史上有二百多年天下。李渊在位九年，由李世民（唐太宗）接位。"
    }, {
        id: "第八十四签",
        lv: "下签",
        title: "庄子试妻",
        content1: "因名丧德如何事 ，切恐吉中变化凶",
        content2: " 酒醉不知何处去 ，青松影里梦朦胧 ",
        detail1: "【卦意】此卦寒鱼离水之象，凡事不可移动也。 ",
        detail2: "【解签】因为虚名而失去道德修养，哪里能够得到认同?忙中有错更恐招来祸患;如人酒后茫茫，东南西北不知何处去，却是在青松树下睡着了!寒鱼离水，美中不足，若问营谋，如何结局。此签因名丧德之象，凡事劳费心力。本签者。因名丧德之象。因之。凡事劳费心力而无益者也。为了攫取一己之名利。丧其德行。受世人辱骂。指摘者何用。神灵诫之曰。切忌忙中变作凶。本为善意。惟己之言行中不知不觉中。将善心变为恶而导致凶。易言之。君之命也。寒鱼离水美中不足若问营谋如何结局。",
        detail3: "【解释】此签有”忙中有错”之意。奉劝当事人，凡事谨言慎行。人在忙碌或无意识的状态下，很容易说错话做错事。也许本身并无恶意，但所谓”覆水难收”，很可能因此而伤害到对方。所以应时刻谨慎小心，注意自己的言行举止。倘若是规劝对方，也不宜因为太过求好心切而口出恶言。否则原本的一番好意却随着情绪影响而变质，岂不甚是遗憾。相反地，对于他人的讥讽批评，也不要因此怀恨在心、甚至想找机会报复羞辱回去。须知”己所不欲，勿施于人”，凡事包容宽厚，可让事情更两全其美。 ",
        detail4: "【典故】庄子是春秋战国人，大思想家。有一天，他心血来潮，问他老婆，在他死后，是为他守节，还是会再嫁？他老婆自然是信誓旦旦。庄子修炼道法，便以诈死试妻，停柩厅中，他幻化一美男子到来吊丧，自称是老庄远方好友，庄妻为其风仪所迷，两人眉来眼去，正在朗情妾意的时候，那男子捧心倒地，大呼心痛，说除非有‘人心’做汤，服之可愈，就是死了不过三日得人心也可以，庄妻乃演出‘大劈棺’的一幕，要取棺中庄子的心救其情郎，棺木劈开，庄子一跃而出。今古奇观。 "
    }, {
        id: "第八十五签",
        lv: "中签",
        title: "韩文公遇雪",
        content1: "云闇雾罩山前路， 万物圆中月再圆 ",
        content2: "若得诗书沉梦醒， 贵人指引步天台 ",
        detail1: "【卦意】此卦春尽花开之象，凡事主后改变也。 ",
        detail2: "【解签】重新出发，将过去的事封存，在万宝园中再度聚首;安闲快乐地把酒言欢吟诗作乐，待得贵人牵引时，就能一鸣惊人了啊。老者还来，春暮风和，欲求名利，早晚遇财。此签春暮花开之象，凡事求谋俱吉。本签者。暮春百花盛开之时。凡百事求谋俱吉者也。沉滞已久之命运。于今逐渐入佳境。珍惜此时。把握本刻。立即动之。汝之运途将为尔辟坦途。亦即是万宝园中可再团。易言之。老者还来春暮风和欲求名利早晚遇财。",
        detail3: "【解释】此签有”百折不挠”之意。提醒当事人，凡事努力不懈。其实不管做什么事、求什么学问，最重要的就是要有恒心跟毅力。但在日复一日的过程中，人容易变得怠惰且厌倦，也最恐因而导致事情前功尽弃、努力付诸流水。此刻心态的调整很重要，必须沉得住气，时刻自我期许。把握任何可以练习揣摩的机会，深刻了解所学，也可同时加强信心。对于他人的批评与指责，不妨虚心接受，当成激励自己的指教。多方尝试与努力改进缺失之后，定可融会贯通并且活用，将专才彻底发挥到淋漓尽致。 ",
        detail4: "【典故】唐朝时大文学家，韩愈，谥文公，韩文公的侄儿韩湘子（八仙之一）会法术。一天文公生日，湘子到来贺寿，文公说：“你有法术使美酒开花吗？”湘子说：“可以。”不久果然美酒开花，花间现出二行金字：云横秦岭家何在，雪拥蓝关马不前。文公不解，后来文公被朝廷贬职，到了蓝关，遇到大风雪，马不能前进，文公才悟其意。 "
    }, {
        id: "第八十六签",
        lv: "上签",
        title: "商辂中三元",
        content1: "春来花发映阳台 ，万里车来进宝财 ",
        content2: " 若得禹门三级浪， 恰如平地一声雷",
        detail1: "【卦意】此卦上朝见帝之象，凡事大吉大利也。",
        detail2: "【解签】春天时百花盛开，在阳光投射下楼台呈现美丽的疏影，有人自万里之外驾船送来满满的珍宝;相信鱼跃龙门时来运转之时，就似春雷一声乍响，震撼了大地。帝朝受职，如贫得宝，望用从心，签中第一。此签帝朝受职之象，凡事遇贵则吉。本签者。帝朝受职之象。凡百事兴者遇贵则吉利者也。春来花发。是百花争妍斗艳之刻。万里舟行进宝来其声声之旺也。如跃过禹门三级浪。恰如平地一声雷响起者。易言之。帝朝受职如贫得宝望用从心签中第一。",
        detail3: "【解释】此签有”念兹在兹”之意。意味当事人，任重道远。孔子的高徒颜回说过：”舜何人也?予何人也?有为者亦若是。”倘若有心想要做好事，就要坚守决心，时时充实自我不断学习，并贯彻到底。很多事是一种机缘，环环相扣。此时也许看不出来，却极有可能是日后成大就的必经过程之一。切勿小看自己，每个人在这个社会上都是栋梁之才。相信道德为一切的根本，不管经过多久，也不会退转初衷。",
        detail4: "【典故】商辂，明朝浙江人，父名商琳，早逝。尚辂从小由母亲抚养，天资聪慧。古代科举（考试）制度分乡试，省试，殿试（等于现代的小学，中学，大学考试），第一名为解元，会元，状元。尚辂在这三次考试中都获得第一名，故称连中三元。《三元记》传奇故事。"
    }, {
        id: "第八十七签",
        lv: "中签",
        title: "咬金探地穴",
        content1: "人行半岭日西山，竣岭崖岩未可安",
        content2: "仰望上天为护佑，此身犹在太平间",
        detail1: "【卦意】此卦淘沙见金人处险境之象，凡事有贵人之兆也。 ",
        detail2: "【解签】行走到半山腰时，感觉赤辣的太阳似乎要把山给吞没了，如此险峻的山势找不到可以再攀附上升的途径;望着天空，祈祷上苍庇护保佑，我这个躯体就犹如迷失在虚无广阔的空间之中啊!剖石见玉，淘沙见金，须用着力，劳心成就。此签淘沙见金之象，凡事劳心有成。本签者。淘沙见金之象也。凡百事劳心即有成之命运。目下居于日衔山之境。且前面正遇丛山峻岭。艰苦历程中。苦中不得不仰头祈求上苍垂护佑。己身犹在太虚之间。唯劳心可成之命。易言之。剖石见玉淘沙见金须用着力劳心成就。",
        detail3: "【解释】此签有”柳暗花明”之意。勉励当事人，凡事勿轻言放弃。有时人在遭逢困境的时候，想法不自觉会变得很负面，浑身提不起劲，甚至对任何事都感到绝望。与其消极丧志，不如换个心情、换个角度想。所谓天无绝人之路，在遇到挫折困境的时候，不要太快就否定了自己，也不要因为一时的悲观而想不开。人生有时重要的不是结果，而是过程。这个过程也许辛苦，但同时却也是学习成长的好机会。俗云”山不转路转，路不转人转”，保持好心情，事情一定会有转机的! ",
        detail4: "【典故】程咬金和徐茂公等瓦岗寨英雄在设宴庆祝胜利，突然演武场地裂开一大洞，众人称奇，却没有人敢下去探究竟。徐茂公叫大家沾字抽签，结果咬金抽中，进入地穴探察，地洞内有石门、石桥，到了厅中，发现桌子上有龙袍玉带等宝贵物件，咬金穿在身上，从竹筐子爬了上来，安然无事，后来，咬金做了三年的‘混世魔王’。《说唐全传》故事 "
    }, {
        id: "第八十八签",
        lv: "下签",
        title: "庞洪畏包公",
        content1: "林为一虎在当门 ，须是有威不害人",
        content2: "分明说是无防事 ，忧恼迟疑恐惊心 ",
        detail1: "【卦意】此卦木虎有威之象，凡事虚惊少实也。",
        detail2: "【解签】虽然知道山林里是一只木头雕刻而成的老虎，但远远看着它的容貌，仍然忍不住打起寒颤;即使口头上说不碍事，但心里终究感到畏惧，就好像躯体已被卷入大江之中一般啊。炉头点雪，耳边过风，可宜作福，前凶后吉。此签木虎虚惊之象，凡事宜守待时。本签者。木虎虚惊之象。凡百事宜守待时方吉安。千万叵倚强凌弱。远望威容意不禁者。即使木虎不必畏惧。但己身如同入大江心。岌岌可危。必须防贪求不已。生祸福无不自求者。必慎之。易言之。炉头点雪耳边过风可宜作福前凶后吉",
        detail3: "【解释】此签有”揠苗助长”之意。奉劝当事人，凡事勿操之过急。有时当我们听到一件事，尤其是跟自己有利害关系时，因为事情还不明朗，常因此变得提心吊胆，好的希望它赶快发生，坏的希望它不要成真。好的也急，坏的也急。然而急就章的结果，往往都是适得其反，甚至造成无法弥补的过失。须知很多事都只是空穴来风，在未确定之前，宁可按兵不动、先保持观望。倘若是别人的事，也不要因此而热心过头，最后反而变成自己”一厢情愿”、自找麻烦，既帮不到别人，又弄得一鼻子灰。凡事保持客观，避免先入为主。 ",
        detail4: "【典故】庞洪是松仁宗皇帝的妻舅，称为国丈，由于势力大，在朝廷里为非作歹，陷害忠臣。他串通了奸臣杨淘，定计谋害大将狄青，说他杀死妻子，所有官员都审查不出谁是主谋。包公回朝后，要求审办此案，庞洪惊畏不已。案件结束，庞杨二人被包公查出罪状，有人证物证，要皇帝判罪，但终被仁宗皇帝以亲戚关系为理由，释放了二人。 "
    }, {
        id: "第八十九签",
        lv: "上签",
        title: "大看瑶花",
        content1: "出入营谋大吉昌 ，似玉无瑕石里藏",
        content2: "若得贵人来指引 ，斯时得宝喜风光 ",
        detail1: "【卦意】此卦石藏珍宝之象，凡事称心大吉也。 ",
        detail2: "【解签】出外求谋运势极佳，就好似原本深藏在石头中的美玉;如今因得高人提点指示将其取出，如获至宝欢喜无限。如玉藏石，贵人指出，得宝称心，遂意大吉。此签玉藏石中之象，凡事称心大吉。本签者。玉藏石中之象。凡事称心大吉昌者也。灵签曰。出入营谋大吉昌。君今逢无瑕之玉藏石中。能获贵人指点。扶持。终能得宝。此时此刻当喜十分。令人雀跃者。惟称心时不可大意者。更不忘修德。积善。易言之。本签为如玉藏石贵人指出而得宝称心遂意大吉者。",
        detail3: "【解释】此签有”有志竟成”之意。提醒当事人，事在人为。我们在人生中，可能有些事情，想去做，但是却迟迟没有去实行。随着时间一天一天的流逝，对于心中”想要去做”的这个念头，可能会变得越来越犹豫、或者拖一天算一天。与其放任空想得过且过，何不化消极为积极，多方打听、四处留意，只要有机会，就主动把握并努力去尝试。不要怕来不及或担心拖太久，相信只要有心，随时都会有新的契机。 ",
        detail4: "【典故】琼花年开一次，且在晚间。隋炀帝听得扬州有琼花，即动用民工开凿运河，南下扬州看花，被杀隋亡。或指欣赏仙境之宝花。 "
    }, {
        id: "第九十签",
        lv: "上签",
        title: "苇佩遇仙",
        content1: "忽言一信向天飞 ，泰山宝贝满船归",
        content2: "若问路途成好事 ，前头仍有贵人推",
        detail1: "【卦意】此卦功名成就之象，凡事宜进大吉也。 ",
        detail2: "【解签】意想不到的好消息从天而降，犹如船上装载着满满的珍宝荣归;若要问前程事物最后的发展，早晚还是会得到贵人的帮助啊。欲问功名，贵人遇得，更增福庆，财禄进益。此签功名成就之象，凡事进身大吉。本签者。功名成就之象。凡事进身大吉也。君尔之今运也。忽朝一信天下墀之时。宝贝船装满载归之时。若问前程于神仙。君之今也。始终应得贵人提之刻。凡百事得真人。顺利推进之运。上上者。易言之。君汝之今。欲问功名贵人遇得更增福庆财禄进益者耶。",
        detail3: "【解释】此签有”深入人心”之意。提醒当事人，凡事以诚相待。在人与人合作的社会，凡事无法光靠个人的单打独斗，也必须仰赖他人的长才。当我们对某人的才华十分激赏、求贤若渴时，会想要用尽一切办法来获得。但有时越是才华洋溢、充满智慧的人，越难以被世俗的虚荣所打动。此时与其用尽千方百计，还不如以”诚意”做起。”诚”出自于自身的内心，没办法用任何外物修饰。它的影响力缓慢但却可以深植人心。凡事以诚待人，相信对方一定也会被感动。荣华富贵虽然可以诱惑一个人对物质的需求欲望，但”诚意”却可以融化外在的一切，牢牢地抓住每个人的心。",
        detail4: "【典故】韦丹，唐朝时人，年进四十还没考中科举。一天，乘驴至洛阳中桥，见渔人出售一双大鳖，置于桥上，呼呻喘气，快将死去。因见其可怜，自己身上又无钱，只好以驴子交换，然后将他放于水中，徒行而去。后遇一算命先生，得其引见一老翁，须眉皓然，身长七尺，见了韦丹就礼拜，称他为救命恩人。老翁殷勤对待韦丹，并从怀中取出一卷文书，说是从天府衙门中抄来的，证明韦丹一生做何官职，开始与何时，至于何时等资料，都是命中注定，上天安排。几天后告别，又借予韦丹五十千文钱，后来一切皆应验，韦丹春风得意，加官进禄，总共十七任。据说，老人就是天上神龙的化身。河东记。 "
    }, {
        id: "第九十一签",
        lv: "上签",
        title: "三战吕布",
        content1: "好展愁眉出众来 ，前途改变喜多财",
        content2: "一条大路如天阔 ，凡有施财尽畅怀",
        detail1: "【卦意】此卦前途显运之象，凡事通泰大吉也。 ",
        detail2: "【解签】请将深锁的眉头舒展开来吧，未来必有举荐大用;前方宽广的大道平坦地好似摊开的手掌，一切只要付诸实行，总能称心如意!一条大路，尽可施为，心中用事，只宜向前。此签前程有路之象，凡事施为则吉。本签为前程有坦途可行之象。凡事谋之行之立见吉利者也。一条坦途可向前行。心中用事不必瞻前顾后。勇往迈进事事可如意。顺利吉昌者。唯行在顶峰。傲视下界之际。勿忘今日之所由生。皆由贵人扶之者。易言之。必留个余地。以防向下坡之崎岖。",
        detail3: "【解释】此签有”万全准备”之意。提醒当事人，凡事勿拖泥带水。在人生中，我们三不五时会面临许多新的机会或重大的决定，尤其是情况有急迫性、时效性时，人往往会对之后不可预知的结果而产生犹豫、或变得不知如何是好。此时切记沉着冷静，慎重考虑目前的环境与情势，分析出有利自己的优缺点，然后做出正确的决定。倘若拖泥带水、迟疑不决，可能导致错失良机。平时就要做好准备，免得突发状况时手忙脚乱。 ",
        detail4: "【典故】吕布英勇无比，认董卓为父。董卓令吕布领三万大军，扎住于虎牢关，准备迎战曹操和刘备军队。吕布领兵迎战。首先是张飞和吕布酣战，不分胜败，关公见了，随即加入，左右夹攻，刘备也从旁边加入助战，三人厮杀在一块，不分胜负。吕布见不能胜，飞马往关上逃，刘关张三人直追，此为著名的‘三英战吕布’。吕布后来归顺曹操，又在白门楼被曹操杀死。"
    }, {
        id: "第九十二签",
        lv: "上签",
        title: "蔡卿报恩",
        content1: "自幼为商任设谋 ，财禄盈丰不用求",
        content2: "若是双身谋望事 ，秀才出去状元回 ",
        detail1: "【卦意】此卦自小为商之象，凡事勤俭无忧也。",
        detail2: "【解签】从商获利时自然称心开怀，更何况荣华富贵倍增;倘若要问求谋加官等事，终能一举状元，衣锦还乡。自小至大，无相无碍，诸事遂吉，谋望自在。此签进身大吉之象，凡事操心大吉。本签者。进身大吉之象也。凡百事兴时操心大利。灵诗示之云。经商得利称心怀。福禄面也。荣华倍获财。君汝如问谋望之面。神可告之君。必能一举状元衣锦还乡者。易言之。汝自幼小之年。自小至大无相无碍诸事遂意。遂望自在耶。",
        detail3: "【解释】此签有”择善固执”之意。提醒当事人，凡事相信。人们最大的痛苦，莫过于对人性产生了怀疑。因为凡事疑神疑鬼，自我的内心开始筑起了高墙，担心被骗、被利用而受伤。但是，处处防着别人，凡事都过度小心、过度猜测的结果，不但于事无补，反而只会让自己越来越神经质;而你回应给别人的不信任感，别人同样也会回报在你身上。与其因为怀疑而产生更大的痛苦，还不如凡事包容、凡事相信。事情没有那么复杂，是人的心使它复杂。保持一颗赤子之心，相信人性本善，以真诚待人，包容厚道，人生何处不逍遥。",
        detail4: "【典故】蔡邕新婚不久，即辞别妻子赵五娘，上京考试，五娘辛勤持家，落难受苦，日子十分难过，幸得善人张广才救济。后来蔡邕考中状元，做了大官，又和牛丞相女儿牛小姐结婚，五娘历尽千辛万苦，上京会见了蔡邕，夫妻重逢，和牛小姐一同回乡扫墓，蔡邕赠送许多金钱给张广才，以报答其恩德。‘卿’是古时皇帝封大臣的爱称。明代《琵琶记》传奇故事。 "
    }, {
        id: "第九十三签",
        lv: "中签",
        title: "高君保招亲",
        content1: "鸾凤翔毛雨淋漓 ，当时却被雀儿欺",
        content2: "惊教一日云开远 ，依旧还君整羽衣",
        detail1: "【卦意】此卦鸾凤被雨之象，凡事待时大利也。 ",
        detail2: "【解签】凤凰身上的羽毛被雨打湿紧垂，在此同时还得承受雀鸟轻慢相欺;待有朝一日天晴大放光明之时，终将再度展翅高飞，依旧在万鸟中称王!小人正盛，君子莫为，暂时守己，自有亨通。此签未用君子之象，凡事先难后易。本签示之于弟子曰。未用君子之象。凡事先难。因谋事之敏。终获吉利者也。君汝之目下命。人在穷困之际。啻好屈己忍之。强欢言笑。千万叵急躁恼怒。斯时四面楚歌。皆陷阱也。易言之。小人正盛君子莫为暂时守己自有亨通之时也。",
        detail3: "【解释】此签有”邪不胜正”之意。意味当事人，保持冷静。很多现象只是短暂的、表面的，切莫因此灰心丧志。尤其在小人当道之时，千万不可乱了方寸，更不要随波逐流。对于旁人的明嘲暗讽，何妨忍一时。坚守内心良知认为是对的事，做好份内之事。表面上也许是强颜欢笑，但内心依然保持自我的清明，相信自己做的任何事，都是本应如此，没有对不起自己，也没有对不起任何人。",
        detail4: "【典故】高君保即高俊保，是宋朝高德怀的儿子。宋太祖赵匡胤征南唐被困，高君保运粮食前往解救，路过双锁山，被女大王刘金定劫持上山，强迫结为夫妻。《宋太祖征南唐》故事。 "
    }, {
        id: "第九十四签",
        lv: "下签",
        title: "伯牙访友",
        content1: "君子莫体小人为， 事若差池惹是非",
        content2: "琴鸣须用知音听 ，守常安静得依稀 ",
        detail1: "【卦意】此卦要逢知己之象，凡事守常则吉也。",
        detail2: "【解签】须知君子与小人有贤愚之分，但事情的对错与是非要如何区别呢?就像抚琴若遇知己时即能一拍即合，与其争执不休，还不如沉默是金来的有利吧!知音行正，百事莫理，若人遇贵，无价珍美。此签未遇知音之象，凡事耐性则吉。本签者。君尔未遇知音之象也。凡事耐性行之。为之则趋吉也。平素多信仰神佛扶之。能遇贵人之时。君即可争如定静得便宜耶。易言之。汝在功行圆满之刻。必能光大门户。知音行正百事莫理若人遇贵无价珍美耶。",
        detail3: "【解释】此签有”争不如静”之意。提醒当事人，凡事耐性。每个人都有自己的一套看法与想法，有时难免与人意见相左。然而公说公有理、婆说婆有理，有时与其争论激辩，不如保持缄默。即使别人有误解、不了解，又何必放在心上，只要心中清亮，知道自己在做什么就好，实在无须在意别人怎么看、怎么说。 ",
        detail4: "【典故】伯牙是春秋时代人物，善弹琴，相传伯牙操琴，琴声高妙，只有钟子期才知其音，二人成为知音朋友。子期在江旁会见伯牙，谈论琴中意，高山流水声。第二年，伯牙到马鞍山造访知音好友子期，知道钟子期已死，伯牙伤心极了，遂破琴弦，从此不在弹琴。伯牙是晋国人，钟子期是楚国的一名樵夫（砍柴人）。今古奇观。 "
    }, {
        id: "第九十五签",
        lv: "中签",
        title: "曹丕称帝",
        content1: "志气功业在朝朝 ，今将酒色不胜饶",
        content2: "若见金鸡报君语 ，钱财福禄与君招 ",
        detail1: "【卦意】此卦志气功名之象，凡事守常大吉也。 ",
        detail2: "【解签】早晚在事业上积极奋斗，获取的荣华物质必定丰盈;请你记得当年鸡鸣即起的初衷，自然能更进一步，超越颠峰。事业功名，守己待时，金鸡终叫，实时亨通。此签功名待时之象，凡事必就大利。本签者。功名待时之象。凡百事必就大利者耶。上上之签。百事皆有遂意之可能。繇于祖德之深。君尔又顺理而行。益加倍植。则天之报应。具有复泰之象。占此签之君慎守之。易言之。尔之今也。事业功名守己待时金鸡终叫实时亨通之刻耶。",
        detail3: "【解释】此签有”勤勉奋发”之意。勉励当事人，凡事要有毅力。要下决心不难，但要实际付诸行动、并且持之以恒却不容易。所谓”养兵千日，用在一时”。平日不间断地充实自己、做好对事物的准备，并时刻提醒自己不要松懈，每天一点一滴所慢慢累积出来的实力，相信届时定能一鸣惊人，成功指日可待。 ",
        detail4: "【典故】三国时代，曹操、刘备、孙权三足鼎立，分治天下。公元二二○年，魏王曹操死后，他的第二个儿子曹丕将汉献帝迫下台来，自己登位做了皇帝，改国号‘魏’，称号‘文帝’，建都洛阳。曹丕只做了七年皇帝，魏国也仅有四十多年天下，终归司马炎（晋朝）。三国故事 "
    }, {
        id: "第九十六签",
        lv: "上签",
        title: "窦燕山积善",
        content1: "巍峨宝塔不寻常， 八面玲珑尽放光 ",
        content2: "劝君立志勤顶礼， 作善苍天降福祥 ",
        detail1: "【卦意】此卦福德现身之象，凡事大吉大利也。",
        detail2: "【解签】高大的宝塔非比寻常，四周晶莹剔透精雕细琢；劝你诚心祈祷膜拜，必有万神降瑞，拥护吉祥。这此福田，诸人皆现，可用诚心，福德即到。此签福德显现之象，凡事营谋吉利。本签者。福德显现之象也。凡百事营谋可获利者耶。君之前。此宝塔为耸立云霄巍巍者。八面均放出异彩。啻要君志心勤顶礼。天龙。此吉祥之天兽。为君汝降天祥者。易言之。这此福田诸人皆现可用诚心福德即到。",
        detail3: "【解释】此签有”终能如愿”之意。鼓励当事人，凡事有始有终。人人都希望能有功成名就、大富大贵之日，但别忘了”三分天注定，七分靠打拼”的道理。既然有理想、有梦想，就要靠自己，努力的让它付诸实现。所谓”天助自助者”，与其祈祷上苍，不如将愿望化为实际的行动。凡事只要肯做、肯冲、肯拼，抱持着勇往直前、积极进取的态度、持之以恒，必有成功之日。 ",
        detail4: "【典故】宋朝时人，名窦禹均，因住在燕山，又叫燕山。初时，燕山为人不正，心术不好，专做伤天害理的事，至到三十岁，还没有儿女。一晚，他梦到父亲劝他悔过行善，才能挽回天意。燕山从此痛改前非，重新做人，并且广行方便，大做善事。后来生了五个儿子，因管教严明，都有良好成就。他在家贴的门联如下：为善必昌：为善不昌，祖宗之余殃，殃尽必昌；为恶必减：为恶不减，祖宗之余德，德尽必减。《全德记》故事。 "
    }, {
        id: "第九十七签",
        lv: "中签",
        title: "六出祁山",
        content1: "当风点烛空疏影， 恍惚铺成镜里花",
        content2: " 累被儿童求收拾， 怎知只是幻浮槎 ",
        detail1: "【卦意】此卦当风点烛之象，凡事虚名少利也。 ",
        detail2: "【解签】园林中的树枝因风吹拂摇摆，透过月光的照射，彷佛在地上铺满了整片晶莹的美玉;几次想要叫童子来打扫干净，但地上的影子哪里能够收拾得起来呢?富贵在天，贫穷由命，不用机谋，皆有分定。此签虚名薄利之象，凡事不宜贪求。本签者。虚名薄利之象。凡百事不得贪求者也。诗曰：恍若铺成满地琼。岂知收拾总无成。如君之行动不紧速。将闹得无法收拾。谣言四播。到头来将陷入罗网中自拔不得。如此苦境只有几人知。易言之。君目下之运也。该知富贵在天。贫穷由命不用机谋。皆有分定者耶。",
        detail3: "【解释】此签有”欲念无穷”之意。奉劝当事人，凡事不要过贪。对于身边的物事，取之平衡、够用就好，不应得寸进尺，任由欲望无止尽的扩大。无论是贪多、贪快、贪急都不好，不但对事情本身毫无帮助，甚至反而会导致反效果。凡事应能谨慎节制，时刻检视、约束自己的欲望;知足才能常乐。 ",
        detail4: "【典故】诸葛亮回到成都后，三年按兵不动。这年建兴十二年春二月，亮又对后主（刘禅）说要第六次出祈山，统帅全军攻打魏国，天文官劝他不可出兵，恐有不利，他坚持要出，说：“鞠躬尽瘁，死而后已”。这回出师果然不利，诸葛亮病死五丈原。浮槎：传说中来往于海上和天河之间的木筏。《三国演义》 "
    }, {
        id: "第九十八签",
        lv: "下签",
        title: "吉平遇难",
        content1: "出入求谋事宜迟 急恐哀愁惹是非",
        content2: "如鸟飞入罗网内 脱困能有几多时 ",
        detail1: "【卦意】此卦守旧随缘之象，凡事不如意主凶也。",
        detail2: "【解签】经商求谋疑东疑西，恐怕遭致不必要的困扰与是非;就似飞鸟陷入罗网之中，这种情境能有几人了解呢?禽遭罗网，有理难分，随缘守旧，遇贵乃成。此签禽遭罗网之象，凡事守旧则安。本签者。禽遭罗网之象。凡百事守旧可获安者。诗曰。经商出入事迟疑。也因此惹闲愁。不必要之愁争。听了是是非非。谣言四播。逢遇如此罗网苦境中。必须多修福。积德方能脱离险境者耶。易言之。君之今也。禽遭罗网有理难分。随缘守旧遇贵乃成之命耶。",
        detail3: "【解释】此签有”借口逃避”之意。奉劝当事人，凡事不要推托。每个人都有应尽的义务与责任，在”任务”尚未达成之前，万万不可推托卸责、或自认为理所当然，把借口合理化。尤其是为人父母者，更应负起责任，绝无任由对方辛苦、自己逍遥快活之理。遇事不要选择逃避，凡事都应勇于面对、接受。须知每个人的内心都向往能自由自在无忧无虑，因此更应将心比心，绝对不要把自己的快乐建筑在别人的痛苦上。 ",
        detail4: "【典故】吉平是三国时代的明医，洛阳人，因痛恨曹操为人骄横霸道，和朝臣等人商议谋杀曹操，被家奴偷听到，向曹操告密。曹操假装患头风病，召吉平用药医治。吉平就在药中放了毒药，以毒死曹操。曹操早知有毒，即刻拿下吉平，刑枷拷打迫问，吉平终不肯招供，还破口大骂曹操，最后头撞石头而死。《三国演义》 "
    }, {
        id: "第九十九签",
        lv: "下签",
        title: "陶三春挂帅",
        content1: "勒马持鞭直过来 半有忧危半有灾 ",
        content2: "恰似遭火焚烧屋 天降时雨荡成灰 ",
        detail1: "【卦意】此卦半忧半喜之象，凡事只宜行善也。 ",
        detail2: "【解签】闲来无事抽鞭驾马而来，是福是祸还难以预料;就好像大火刚烧至屋顶，谁能知忽然上天降了场及时雨，把火势给浇熄了。知如不知，不管是非，身临枷锁，恩赦放归。此签凶危有财之象，凡事先凶后吉。本签示之于弟子曰。凶危有财之象。凡事凶后吉耶。等闲骑马着鞭来。半有忧危半有财。似火方烧头上屋。正受灾殃之刻。一场大雨来了之后。方可将灾厄洗清而去。目下虽事难成。劳心劳力之后。必有转安之时。易言之。君汝也。知如不知不管是非身临枷锁恩赦放归。",
        detail3: "【解释】此签有”祸福未定”之意。提醒当事人，凡事保持乐观。须知事事无绝对，好的不见得就好，坏的也不见得是坏。有些事情往往出乎我们意料之外，是好是坏，不到时候，都还很难说。因此，何必杞人忧天，去设想还没有发生的事。不如保持平常心、凡事乐观以对。所谓”既来之，则安之”。须知有得必有失，有失必有得。 ",
        detail4: "【典故】陶三春即宋朝初年郑恩（子明）之妻。初，赵匡胤和郑恩结拜为兄弟，著名武师陶洪有女名陶三春，郑恩与之比武，不能取胜。陶洪爱郑恩之武艺人才，将三春许配与他为妻。后来三春之子郑印长大往山中学艺，十二年后才回家，并带着妻子王玉娥到汴京认母。这时赵匡胤征南唐被困，石朝怀回朝搬兵，陶三春挂帅带郑印，王玉娥等率兵下南唐，与高俊保刘金定夫妇会师作战。《宋太祖征南唐》故事。 "
    }, {
        id: "第一百签",
        lv: "下签",
        title: "三教谈道",
        content1: "佛神灵变与君知 ，痴人说事转昏迷 ",
        content2: "老人求得灵签去 ，不如守旧待时来 ",
        detail1: "【卦意】此卦守常勿动之象，凡事宜待时吉也。 ",
        detail2: "【解签】一下想往东，一下又想要向西，遇人说话反复无常;就似爬上了高山，终究找不到神仙的踪影，倒不如回去吧，别再提这件事了。此签及百，祈之未然，营谋用事，费力流连。此签无常无定之象，凡事多虚少实。本签者。无常无定之象。外虚少实者也。第一百首。是盈数。为全数之末。亦即言。它是前数之终。后数之始。易言之。黑暗将去。黎明到来之征。表面上是没落之相。其实是通亨衢之意。唯集福之本。宜小心集之。及百祈之未然营谋用事费力流连。",
        detail3: "【解释】此签有”不切实际”之意。奉劝当事人，凡事脚踏实地。有些事是可遇而不可求，切勿妄想执着。对于昙花一现的物事，倘若就此眷恋不忘，无异于守株待兔，只不过是浪费时间、枉费心力罢了。与其执着在不确定的事情上面，还不如跳脱迷思，自力更生。凡事务实、一步一脚印，须知一分耕耘，才有一分收获。有梦想就必须靠自己努力打拚来实现，不然就只是流于空想罢了。",
        detail4: "【典故】三教是指：佛（释迦牟尼）儒（孔夫子）道（张道陵）三教派。北周武帝（公元五六一年）时，佛儒道人士纷争和互相排斥，佛教尤受其害。皇帝于是召集佛儒道三教派的代表人物，以辩论所奉的‘道’高低长短，并排名定位，经过三次集会争辩，都没有结论，从此三教派在中国民间自由发展，后佛教演义为中国人民信仰的主流。也有三教同源之说。 ◿䡲￿￿￿￿◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲￿◿䡲◿䡲￿爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿爥╈䡲爥￿￿￿￿￿￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲￿￿爥╈￿￿￿￿爥╈䡲爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲￿￿￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿￿￿￿爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲￿￿￿￿◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲￿◿䡲◿䡲￿爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿爥╈䡲爥￿￿￿￿￿￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲￿￿爥╈￿￿￿￿爥╈䡲爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲￿￿￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿￿￿￿爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲￿￿￿￿◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲￿◿䡲◿䡲￿爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿爥╈䡲爥￿￿￿￿￿￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲￿￿爥╈￿￿￿￿爥╈䡲爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲￿￿￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿￿￿￿爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲￿￿￿￿◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲￿◿䡲◿䡲￿爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿爥╈䡲爥￿￿￿￿￿￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲￿￿爥╈￿￿￿￿爥╈䡲爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲￿￿￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿￿￿￿爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲￿￿￿￿◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲￿◿䡲◿䡲￿爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿爥╈䡲爥￿￿￿￿￿￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲￿￿爥╈￿￿￿￿爥╈䡲爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲￿￿￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿￿￿￿爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲￿￿￿￿◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲￿◿䡲◿䡲￿爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿爥╈䡲爥￿￿￿￿￿￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲￿￿爥╈￿￿￿￿爥╈䡲爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲￿￿￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿￿￿￿爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲￿￿￿￿◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲￿◿䡲◿䡲￿爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿爥╈䡲爥￿￿￿￿￿￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲￿￿爥╈￿￿￿￿爥╈䡲爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲￿￿￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿￿￿￿爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲￿￿￿￿◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲￿◿䡲◿䡲￿爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿爥╈䡲爥￿￿￿￿￿￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲￿￿爥╈￿￿￿￿爥╈䡲爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲￿￿￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿￿￿￿爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲￿￿￿￿◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲￿◿䡲◿䡲￿爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿爥╈䡲爥￿￿￿￿￿￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲￿￿爥╈￿￿￿￿爥╈䡲爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲￿￿￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿￿￿￿爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲￿￿￿￿◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲￿◿䡲◿䡲￿爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿爥╈䡲爥￿￿￿￿￿￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲￿￿爥╈￿￿￿￿爥╈䡲爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲￿￿￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿￿￿￿爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲￿￿￿￿◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲￿◿䡲◿䡲￿爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿爥╈䡲爥￿￿￿￿￿￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲￿￿爥╈￿￿￿￿爥╈䡲爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲￿￿￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿￿￿￿爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲￿￿￿￿◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲￿◿䡲◿䡲￿爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿爥╈䡲爥￿￿￿￿￿￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲￿￿爥╈￿￿￿￿爥╈䡲爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲￿￿￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿￿￿￿爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲￿￿￿￿◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲￿◿䡲◿䡲￿爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿爥╈䡲爥￿￿￿￿￿￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲￿￿爥╈￿￿￿￿爥╈䡲爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲￿￿￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿￿￿￿爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲￿￿￿￿◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲￿◿䡲◿䡲￿爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿爥╈䡲爥￿￿￿￿￿￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲￿￿￿◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲￿￿爥╈￿￿￿￿爥╈䡲爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲￿￿￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲￿￿◿䡲◿䡲爥╈䡲爥◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿￿￿￿爥￿￿￿￿䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲￿￿￿￿◿䡲◿䡲䡲爥╈䡲◿䡲◿䡲╈䡲爥╈◿䡲◿䡲爥╈䡲￿◿䡲◿䡲￿爥╈䡲◿䡲◿䡲╈䡲爥╈￿￿￿￿爥╈䡲爥"
    } ]
}];